[
    {
        "name": "Man Dang Dang BBQ @ Geylang Road",
        "location": "Geylang",
        "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5007033_list_65d2071f-7ea1-4599-ad43-71424b488982.jpg",
        "rating": "3.7",
        "numOfRating": "6",
        "description": "Mookata - Thai BBQ\nServing 4 types of special homemade chilli sauce, authentic from Thailand!",
        "review": [
               "Staffs were very polite and provided great service. My girl and I enjoyed the food very much. Definitely going back for more food.",
               "Though the beer selection is limited, the food is good!",
               "The laksa pasta is great. Salted fried lotus was not crispy but rather chewy though. Fish and chips was normal though.",
               "They have an extremely polite and friendly staff who elevate the experience. Menu is a bit limited but food is tasty. Will definitely go back as the 20% discount is available for walk ins too."
        ]
    },
    {
        "name": "Racines, Sofitel Singapore City Center",
        "location": "Tanjong Pagar",
        "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5011187_list_6520ed40-dfbe-4091-8e6b-7fa07b9a108c.jpeg",
        "rating": "3.7",
        "numOfRating": "5",
        "description": "Rangooli Restaurant is a traditional North Indian restaurant, nestled in the heart of West coast since the 1990s.\nOn top of a serene and quiet ambience, we host authentic North Indian cuisine brought to you by our chefs who hail from Northern parts of India.\nOur chefs bring flavors and techniques from India that translates into the various vegetarian and non-vegetarian dishes that we provide.\nWe promise you, not only a pleasant dining experience, but also a tantalizing experience for your taste buds.\nPlease join us and allow us the opportunity to serve you with tasteful North Indian cuisine at Rangooli Restaurant.",
        "review": [
               "Food quality very good, they need to focus more on ambience. A couple of plates were cracked and there were flies roaming around food"
        ]
    },
    {
        "name": "Renew Deli | Avocados & Acai @ SAFRA Tampines",
        "location": "Tampines",
        "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5006548_list_35d505fa-b3e0-47eb-9a21-1f45663ecaa7.jpg",
        "rating": "3.8",
        "numOfRating": "9",
        "description": "Established in 2009, RUBATO @ Greenwood is one of Singapore's oldest and most prestigious Italian restaurants. Renowned as a cult favorite, it attracts celebrities, ministers, and influential business figures seeking an unforgettable dining experience.\n\nSetting itself apart as the latest opening fine food and gourmet restaurant in Singapore, RUBATO welcomes diners until 2 am for both dine-in and delivery. Craving pizza, pasta, burgers, or steaks at 2 am? Look no further.\n\nWith a menu that combines classic Italian dishes and contemporary culinary creations, RUBATO satisfies all palates. Immerse yourself in the flavors of Italy, even in the late hours, and experience the culinary magic of RUBATO @ Greenwood.",
        "review": [
               "Big and fresh prawns",
               "Return customer - Laksa soup is very nice. Staff is friendly and attentive. Food is fresh and environment is very clean. Highly recommend",
               "Good food",
               "Laksa is good"
        ]
    },
    {
        "name": "Harry's @ Boat Quay",
        "location": "Boat Quay",
        "imageLink": "https://cdn.eatigo.com/filters:format(webp)/eatigo_HarrysBoatQuay_20180504171245_3996.jpg",
        "rating": "4.8",
        "numOfRating": "45",
        "description": "From quality brews to accompanying delectable food, Harry’s has become synonymous with Singapore’s casual bar scene, having come a long way since its very first outlet at Boat Quay in 1992. Should diners get hungry, there are options like options like prawns & seafood aglio olio and light bites such as laksa popcorn chicken and their signature chicken wings. There are large-screen TV on the premises broadcasting live games, so friends can cheer on your favourite teams together.",
        "review": [
               "Enjoyed the food. Service is good too.",
               "Good food and service !",
               "Enjoy the breeze outside, have a few pints over some bar bites, people watch or just enjoy live sports on the telly. Great evening out.",
               "Bun on burger arrived overcooked and rock hard but it was quickly rectified by the kitchen. Fish and chips, fries, Harry’s salad and the margherita pizza were fresh and delicious. Thanks Harry’s for a great meal for me n my family!",
               "The Service is great and accommodating."
        ]
    },
    {
        "name": "House On The Moon @ GR.iD",
        "location": "Dhoby Ghaut",
        "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5012065_list_e6affc5b-6f46-4866-9050-ba39f286009d.png",
        "rating": "4.8",
        "numOfRating": "14",
        "description": "Craving Chinese skewers?\n\nHead to JiaYangDi on West Coast Drive (NEWest) for mouth-watering, authentic skewers grilled to perfection over an open flame. Choose from savory beef, juicy chicken, tender lamb, succulent seafood, and more. \n\nCome visit us and satisfy your skewer cravings today!",
        "review": [
               "have a kids playground",
               "Great food in a comfortable environment."
        ]
    },
    {
        "name": "Kurry Korner @ Changi Business Park",
        "location": "Changi",
        "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5004595_list_a393fa87-3fe2-4661-a7d3-739531f48717.jpg",
        "rating": "4.3",
        "numOfRating": "5",
        "description": "Love your curry? You’ll be hard-pressed to find better than Kurry Korner. Their philosophy here is: we serve what we like to be served. This means that everything served here has no added MSG, artificial colourings and preservatives – just good food using fresh ingredients. Menu standouts here are the Lahori Kadai chicken, Tulsi Kadai prawns and their signature special chicken handi.",
        "review": [
               "Food is delicious, service is too"
        ]
    },
    {
        "name": "Los Amigos @ Boat Quay",
        "location": "Boat Quay",
        "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5011626_list_e53ff6b8-067f-4930-95f7-8aebc3451464.jpeg",
        "rating": "4.2",
        "numOfRating": "8",
        "description": "We take pride in bringing you the best of French Artisan Culinary &\ntraditional Japanese cooking arts. premium selection of ingredients\nand exceptional culinary execution by our chefs, we expect our customers\nto say ‘Miam!’ (Yum!) with every mouthful bite.",
        "review": [
               "Food is fresh and service is good",
               "The food come with sufficiently large portion yet not too much. Only select items are under promotion. The Peking duck is delicious.",
               "We always enjoyed a good value for money lunch menu using Eatigo Apps .Thank u for the good n attentive services by all their staffs in Mouth Restaurant especially Miss Wendy.",
               "Always an enjoyable dinning experiencein Mouth Restaurant for their good services, nice food and value for money menu. Special thanks to Yvonne, Raymond, Ong for their good services at all times.",
               "Highly recommended for their delicious food, good services and reasonable price menu especially great discount using Eatigo apps."
        ]
    },
    {
        "name": "Makan @Jen at JEN Singapore Orchardgateway",
        "location": "Dhoby Ghaut",
        "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/960_list_14f2dc7c-e523-4b85-8120-48c5965c7cfc.jpeg",
        "rating": "4.5",
        "numOfRating": "53",
        "description": "Established since 1988, the Mouth Restaurant specialises in traditional and authentic Cantonese cuisine. Designed to cater to both intimate affairs to large celebratory events, their kitchen specialties include sautéed carrot cake in XO sauce, tenderloin beef cubes in Kobe sauce and mini Buddha Jump Over the Wall. If you prefer dim sum, there is a wide selection of over 100 choices.",
        "review": [
               "Great food, great service… lovely place to celebrate my birthday. Unfortunately, the restaurant was too warm. Time to upgrade your air conditioners.",
               "Just focus on the Pho and you will not be disappointed.",
               "A hidden gem indeed. Food is yummy and portion is good. Lady who served us was attentive and provided good service. One suggestion to your Banhmi is to use pickled veg to enhance the taste.",
               "The food was great but the place is hard to get to.",
               "Great place n nice food. Flexible to start earlier, 15mins before actual. Good deal too"
        ]
    },
    {
        "name": "Mitsu Sushi Bar @ Duxton Road",
        "location": "Duxton Road",
        "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/2662_list_ad4f4044-5392-4b2c-8989-413ae9a11b57.jpg",
        "rating": "4.8",
        "numOfRating": "31",
        "description": "Alacarte, Platters & Buffets, we cater to everyone's appetite. Come enjoy quality mookata with your friends and family!",
        "review": [
               "1 word: SHIOK! Their Pesto pasta and Crab Meat Risotto is absolutely pleasing to the palate. If you need a bit of additional kick, adding a few drops of Tabasco sauce would elevate the flavours further. Unfortunately, they have taken their signature curry series off the Eatigo list.",
               "Very nice pasta alio olio and ariabiatta. Good beer happy hour promo. Aircon could work a bit better though",
               "Great food and value for money… nice atmosphere too",
               "The seafood pasta was very good. Risotto was okay . The vongole pasta was a little bland, not as good . Service was great, but some items were not available probably due to last 1.5hrs before closing. Overall, nice deal .",
               "Affordable and nice!"
        ]
    },
    {
        "name": "San Ren Xing 三人行 @ Thomson Plaza",
        "location": "Upper Thomson",
        "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5011074_list_022c9ab9-c64a-4ae1-89ea-790cce31b50a.jpeg",
        "rating": "4.0",
        "numOfRating": "2",
        "description": "Shanthee’s Curry launched in 2009 at Veerasamy Road as a small family business enterprise. We serve authentic South Indian dishes from Tamil Nadu. Our Chefs hail from Madurai and Karaikudi and are sure to make one feel at home with their delectable cuisine!\n\n Our signature dishes include Southern style Fish Curry, Masala Tea and Egg Kalaki (Fun Fact: We introduced this dish here in Singapore). We also serve fusion food of high quality that is affordable for all.",
        "review": [
               "Reasonable buffet lunch price with a wide range election of food. The service staffs are friendly, attentive and efficient to clear away the dishes too. Well done.",
               "The food are very tasty and nice.",
               "staffs are very helpful & accommodating to customers. nice restaurant to dine-in, frie dly atmosphere 👌",
               "Friendly service staff. Food selection was decent. No WOW factor.",
               "Very delicious food ! Enjoyed the beef rendang, Ayam buah keluak, sotong , satay and many more dishes. Dessert was fantastic with authentic tasting nonya kueh and others."
        ]
    },
    {
        "name": "San Laksa Steamboat @ Kitchener Road",
        "location": "Farrer Park",
        "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5011743_list_06b9824a-cafc-41ff-8efc-edc947fc1c77.jpeg",
        "rating": "4.7",
        "numOfRating": "86",
        "description": "The history of Seorae dates back to Korean monarchs of old, when royal families demanded perfection, where the best quality ingredients were used. The highest quality meat served was galmaegisal, skirt meat that has the perfect combination of tenderness and juiciness. Other must-try meats here are the hangjeongsal (grilled juicy US pork jowl) and samgyeobsal (pork belly). Diners now can get a taste of what Korean royal perfection was all about.",
        "review": [
               "Great food as always!",
               "3rd time at this restaurant and always enjoyed the dishes and great service from the waitress. As it is my son's birthday, the restaurant gave him a longevity noodle soup. So sweet!",
               "Been back",
               "Patient and helpful waiters, food cooked as expected without , especially impressed by the cleanly treated pig intestine, reasonable pricing",
               "Great ambience, nice food and friendly staff. Will come back again!"
        ]
    },
    {
        "name": "Lime Restaurant @ PARKROYAL COLLECTION Pickering, Singapore",
        "location": "Chinatown",
        "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/2244_list_35e65269-682a-4fb3-b661-e7ade89ad71a.jpg",
        "rating": "4.6",
        "numOfRating": "53",
        "description": "Established in 2007, Lotus Thai offers a wide spread of traditional Thai cuisine at Jalan Besar. Diners can expect all the classic favourites here, including steamed seabass with lemon sauce, tom yum seafood fried rice and garlic chicken. Coming with vegan friends? No problem. Lotus Thai also has vegetarian options available. All these are available at wallet-friendly prices, so you don’t have to break the bank to enjoy quality traditional Thai food.",
        "review": [
               "Good place, good food n good service.",
               "Should have added some cut fruits in the buffet",
               "Nice place, good food, good service",
               "order satay & seafood lemak. satay not hot enough when serve & rice too soft, not recommended. Seafood lemak was good, taste like lasak. Soup, salad & drink was free flow. Overall recommended",
               "Good place good service good food"
        ]
 
    },
    {
        "name": "L'Apéritif Lobby Bar @ Novotel Singapore on Stevens",
        "location": "Orchard",
        "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5000490_list_ebd3ffb0-7b7f-46dc-922d-e6f4c5611f54.jpeg",
        "rating": "4.5",
        "numOfRating": "61",
        "description": "Hotpot in Singapore is always a joyful affair. Nothing gets better than close friends or family sitting around a pot of steaming hot broth with plenty of ingredients to satisfy everyone. At La Jiang Shan Hotpot, diners will always have a good time. There are both lunch and dinner buffets every day, allowing diners to enjoy all the food they want at one fixed price.",
        "review": [
               "Well organise. Service was prompt. Only downside was the aircon was not too strong at the corner seat I was at. If not, it would have been perfect.",
               "Excellent value for money, frien",
               "Services is good..food is delicious..Will go again",
               "It would be better lf the meal time can be extended",
               "Very nice staff, pretty value for money"
        ]
 
    },
    {
        "name": "ROUTE 65 Bar & Cafe @ Ubi Techpark",
        "location": "Macpherson",
        "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5011915_list_9b5c18a9-546a-4869-8ab4-8371749745ce.png",
        "rating": "4.7",
        "numOfRating": "16",
        "description": "For more than a decade, Sahara Bar and Restaurant has been delighting visitors with its relaxing ambience set against the charming backdrop of the Singapore River. Set up by former S. League Soccer Player, Esad Sejdic, Sahara not only serves up scrumptious Mediterranean and Persian cuisine, it also serves special Balkan favorites such as Cevapcici and Burek!nTrue to the passion of a sportsman, Sahara also regularly screens live soccer matches and other sports on its many TV screens! Drop by for a taste of delicious char-grilled kebabs and ice-cold beer while catching your favorite sports on TV!",
        "review": [
               "Agree with reviews that food is very tasty, portions are small. Special mention to the excellent service standards at this outlet - very alert, attentive, efficient & friendly staff.",
               "Will dine again",
               "Have been to the restaurant few times, food is good. With Eatigo discount, very worth it.",
               "Yummy hokkien cuisines. Perfect for family gathering or celebration. Service crew is attentive and friendly!",
               "Great food and good service. Love the braised trotter, the corn fish and many more. With eatigo discount is really worth it. Thanks."
        ]
 
    },
    {
        "name": "Seorae Korean Charcoal BBQ @ Plaza Singapura",
        "location": "Dhoby Ghaut",
        "imageLink": "https://cdn.eatigo.com/filters:format(webp)/eatigo_SeoraeKoreanCharcoalBBQ_20170804155027_9883.jpg",
        "rating": "4.4",
        "numOfRating": "13",
        "description": "Striking black and white décor, hints of red, grandly tufted booths and an amber dome; the eye-catching décor is reflected in the walls of cleverly framed mirrors. Not that you'd be staring at your surroundings when there are counters laden with mouth-watering concoctions right before your eyes!\n\nA local flavour buffet by day, Spices Café is a seafood buffet by night and an all-day casual dining destination with an extensive a la carte menu. Located within the Concorde Hotel, visitors will find themselves indulging in a dining experience that reflect the dedicated chef’s culinary styles. They will enjoy dishes like chilli crab, nyonya laksa and ayam buah keluak as they dine within a colonial and regal ambience.",
        "review": [
            "As usual, Tandoori Culture provides good food and outstanding service. So far, none of my friends have been disappointed with the dining experience.",
            "Food was great and service excellent!",
            "Food was good esp the garlic naan. Service was friendly. Will definitely return with the good eatigo discount",
            "The fish curry portion is big and fair amount of meat. Naan is nice! Will come back again.",
            "Excellent service and we enjoyed all the food we ordered. Monthly visit to this restaurant. love the Gobi chilli."
        ]
    }

]