[
       {
              "name": "1864, Sofitel Singapore City Centre",
              "location": "Tanjong Pagar",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5011948_list_5be4ca49-c1da-47da-8f9a-c80091913162.jpeg",
              "rating": "4.0",
              "numOfRating": "0",
              "description": "1864 Lobby Bar (homage to the foundation year of Tanjong Pagar's docking industry) aims to provide the perfect vibe for relaxation. Enjoy a signature afternoon high tea and handcrafted gourmet bites and tapas throughout the day.",
              "review": [
                     "Staff changed my date to 16sep 2023 knowing I booked wrongly Thank You for your kind understanding :)",
                     "Nice caffe , full House on Saturday afternoon",
                     "Food Nice 👍"
              ]
       },
       {
              "name": "98 Bistro @ Kampong Bahru Rd",
              "location": "Outram",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5012152_list_e3a9d346-9229-4f68-8b7a-32890dfd8af7.jpeg",
              "rating": "0.0",
              "numOfRating": "0",
              "description": "98 Bistro is a Bistro located at 85 Kampong Bahru Road, Singapore 169380. 98 Bistro is a popular spot in the Tanjong Pagar area. Whether you're looking for a light bite or the full foodie experience, explore the dishes at 98 Bistro and experience authentic Contemporary food in Singapore.",
              "review": [
                     "Love the food quality at this place and have been visiting it for more than 8 years",
                     "Good food good service",
                     "Breads can be cheaper. Rasmalai (dessert) needs massive improvement. Overall, tasty with decent portions.",
                     "Fantastic service !! Great Food !!",
                     "Excellent service and food is always very good"
              ]
       },
       {
              "name": "Ai Cafe @ Horne Road",
              "location": "Bendemeer",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5011786_list_7768d315-b055-446a-a6fa-3b1a7d0579ae.jpeg",
              "rating": "0.0",
              "numOfRating": "3",
              "description": "Ai Café: Café by Day, Bistro by Night, Casual Dining and Event Space\n\nAi Café seamlessly transitions from a charming café by day to a vibrant bistro by night, offering a dynamic dining experience. Enjoy a cozy atmosphere and a delectable menu during the day, perfect for casual dining. As the sun sets, Ai Café transforms into a lively bistro, serving fusion-inspired dishes and creating an energetic ambiance. Additionally, our versatile space is available for hosting special events, providing the ideal setting for memorable gatherings. \n\nJoin us at Ai Café, where the best of café culture and bistro vibes come together in one remarkable place.",
              "review": [
                     "Staff was so kind to give a free bd cake!! Nice surprise! But cashier couldn’t give the $5 off eating voucher on top of my 50%",
                     "good service, delicious food",
                     "Great food and excellent service",
                     "Good food Portions can be bit bigger",
                     "The food was delicious but charging 8 dollars for a small bottle of Evian water was ridiculous! Either than that everything was good!"
              ]
       },
       {
              "name": "Alter Ego @ Esplanade Mall",
              "location": "City Hall",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5003823_list_d3dfc653-3c01-4096-ae85-cfc5bc4bb103.jpg",
              "rating": "0.0",
              "numOfRating": "2",
              "description": "",
              "review": [
                     "An extra half an hour til 10:30 would be good",
                     "Always the best North Indian food and warm, attentive service"
              ]
       },
       {
              "name": "Anglo Indian Café & Bar @ 1 Shenton Way",
              "location": "Raffles Place",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/eatigo_AngloIndianCafeampBar_20150915142744_5645.jpg",
              "rating": "0.0",
              "numOfRating": "19",
              "description": "Located in the heart of the CBD, Anglo-Indian Café & Bar is popular with office-dwellers wanting a delicious lunch or to knock back a couple of drinks in the evening.  The café prides itself in its superb take on Tikka dishes: here, you can find all sorts of Tikka variations, from wraps and salads to sandwiches and pasta. There is also a wide array of vegetarian dishes to choose from but we love the paneer butter masala best.",
              "review": [
                     "Food variety is lesser than the previous time I visit",
                     "the service is good and the food was nice.",
                     "Will go again",
                     "I have been here many times. Good spread of food provided. Excellent ambience good for family bonding over food and chatting with good friends.",
                     "Good n friendly service from the staff. However, the food variety may need to improve ie. Chicken (Chicken rice) was too dried n bland. Too much Indian food. No cold cuts for salad. No oysters n baby abalone were too hard when chilled with ice."
              ]
       },
       {
              "name": "Anglo Indian Café & Bar @ Chijmes",
              "location": "City Hall",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/eatigo_AngloIndianCafeampBarChijmes_20170731105833_8103.jpg",
              "rating": "0.0",
              "numOfRating": "16",
              "description": "With the British having made India their home over 300 years ago, it was always likely both cultures would have an influence on each other, resulting in Anglo Indian cuisine. This café and bar at CHIJMES offers just that, serving delights like butter chicken, Balti & Palak paneer and chicken tikka BBQ. Seating here is open-air, giving the place a nice relaxing environment that’s perfect for unwinding with friends after work.",
              "review": [
                     "Taste : Good Price : Reasonable Service: Very Good Ambience: Can be better"
              ]
       },
       {
              "name": "Anglo Indian Café & Bar @ Marina One",
              "location": "Marina Bay",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/eatigo_3c323f0e6fa9efd85e1cbd7e42fb9ab9_20180427183633_7830.jpg",
              "rating": "0.0",
              "numOfRating": "5",
              "description": "",
              "review": [
                     "The seafood pasta comes with oyster, clam and small shrimps. Very nice. The carbonara is quite cheesy. Also taste good. Beef cube is soft and nice. Overall very worth it with the eatigo discount.",
                     "delicious food and awesome service , assam oyster noodles is a must try , a good mix of the taiwan oyster mee sua with penang assam laksa and hokkien prawn mee"
              ]
       },
       {
              "name": "Atrium Restaurant @ Holiday Inn Singapore Atrium",
              "location": "River Valley",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/980_list_2ce935b1-d76c-42dd-a808-aa0ae07c35d9.png",
              "rating": "0",
              "numOfRating": "17",
              "description": "Escape to the flavors of Asia with our international buffet spread featuring Korean and Japanese highlights. On top of must-haves such as the Boston Lobsters on Ice, Singapore's Chilli Crab and Roasted Beef Rib-eye, choose from an array of dishes such as Korean Beef Brisket Soybean Paste Stew (Chadol Doenjang JJigae), Korean Marinated Beef (Bulgogi), an assortment of K-BBQ meats, Spicy Stir-Fried Rice Cake (Tteokbokki), Japanese Chicken Katsu, Salmon / Tako Sashimi, Chawamushi, Yakitori and many more! With a variety of options to choose from, you'll be transported to the streets of Seoul and Tokyo in no time. Don't miss out on trying our signature dishes that are sure to leave you satisfied and craving more.",
              "review": [
                     "It’s our favourite place . Love the food and ambiance there. Service is excellent. Friendly staff.👍🏻👍🏻",
                     "Amazing food and great service. Never disappoints. Spicy schezwan noodles with Chilli paneer gravy too good!",
                     "Great service, friendly staff who served us. Food was good too",
                     "Staff are so attentive. Food is great. Value for money. Highly recommended!!!",
                     "Yummy food and good service"
              ]
       },
       {
              "name": "Ayasofya Turkish Restaurant @ Bussorah St",
              "location": "Bugis",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5004111_list_f07e1033-e780-406a-8839-316aa577a163.jpeg",
              "rating": "0",
              "numOfRating": "1",
              "description": "Best Turkish Food in Singapore. If you're looking for the best Turkish food in Singapore, our restaurant is the place to be. We've earned a reputation for being the go-to spot for authentic Turkish food.",
              "review": [
                     "the atmosphere is very good the quality of service is very good the food and drinks are very good I highly recommend it"
              ]
       },
       {
              "name": "Azmi Tandoori Restaurant @ Syed Alwi Road",
              "location": "Syed Alwi",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5011928_list_3152c889-b7d7-49cc-a99d-cf6f7b675286.jpeg",
              "rating": "0.0",
              "numOfRating": "2",
              "description": "Welcome to Azmi Tandoori Restaurant located on Syed Alwi Rd, where we invite you to savor the authentic flavors of India. Our diverse menu features signature dishes like Nihari, Haleem, and Biryani, expertly prepared by our skilled chefs. With a warm ambiance and dedicated staff, we ensure an unforgettable dining experience. Whether you're a seasoned Indian cuisine enthusiast or a curious newcomer, let us take you on a culinary journey that celebrates the essence of India's rich heritage.",
              "review": [
                     "Nice cozy ktv",
                     "Excellent place to chill and food is nice. Just the discount can be better to get more value out of the experience"
              ]
       },
       {
              "name": "BAAN KANOM THAI @ ARC380",
              "location": "Bugis",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5011744_list_f61713a3-7848-49dc-b896-f277fd87d570.jpeg",
              "rating": "0.0",
              "numOfRating": "2",
              "description": "Indulge in Authentic Thai Flavors at Baan Kanom Thai. Immerse yourself in vibrant dishes crafted with fresh ingredients. Experience the essence of Thailand in every bite. Join us for an unforgettable culinary adventure. Sawasdee krub!",
              "review": [
                     "Good service and awesome foods",
                     "Great food and service! Could be quite pricey without eatigo discount though. Limited parking nearby, can consider going to mall carpark opp."
              ]
       },
       {
              "name": "Bahaus by CDC",
              "location": "Bendemeer",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5011957_list_869ac2d9-1683-43db-b1be-b782ba80fece.jpeg",
              "rating": "0.0",
              "numOfRating": "2",
              "description": "Situated in the heart of Hamilton Road, near the Jalan Besar Stadium, whether you're seeking a memorable date night, a lively celebration, or a much-needed escape from the daily grind, Bahaus is your one-stop destination. \n\nThe menu at Bahaus is a culinary masterpiece, showcasing an impressive fusion of flavors that cater to every palate. Whether you're craving savory bites to complement your drink or seeking a full-fledged dining experience, their menu has you covered. \n\nThe attention to detail in presentation and taste is evident in every dish.",
              "review": [
                     "Good food. Good price and good service.",
                     "Went for 50% discount. It was very worth it. Cheese nann is cheesy enough, but Garlic and Butter nann is just average. The mutton masala is very nice. Pizza is nice, thin crust. Buffalo wing at lvl 5 is spicy but good. Beef sausage platter has 3 long sausage. The only disappointment is the ribeye steak which I indicate medium well but it came out well done. Everything on the menu is 50%, even the drink but i did not order as they serve free ice water. Overall I will come back again."
              ]
       },
       {
              "name": "Banjara Fine Dining Restaurant @ Changi Business Park",
              "location": "Changi",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5009516_list_6f0c89d1-156e-4274-8ef6-aaf6ad036d81.jpeg",
              "rating": "0.0",
              "numOfRating": "20",
              "description": "Enjoy an elevated Indian cuisine dining experience at Banjara, where chefs hail all the way from India to provide diners with authenticity. Located within the Changi Business Park district, the restaurant was only founded as recent as 2020. Popular dishes here are the fish head curry, kosha mangsho and palak paneer. Dine out with friend and family, or hold informal business meetings here. Either way, you certainly won’t be disappointed here.",
              "review": [
                     "Love the avocado toast!",
                     "Cafe de Paris is a unique and enjoyable experience, with delicious food and drink, a relaxed and inviting atmosphere, and art jamming sessions that let you express your creativity. Highly recommended!",
                     "Drinks was great.",
                     "Food was good, staff were friendly",
                     "Staff are nice and food is good, especially recommend the waffle ice cream. Food preparation took a while though, but the 50% off makes up for it."
              ]
       },
       {
              "name": "Bar Intermezzo @ Orchard Hotel",
              "location": "Orchard",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5011070_list_de1ea1a9-7d40-4cb9-be45-2088e707e8c7.jpeg",
              "rating": "0.0",
              "numOfRating": "0",
              "description": "",
              "review": [
                     "Amazing house beer!"
              ]
       },
       {
              "name": "Bar Soccer @ Kallang Wave Mall",
              "location": "Kallang",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5011540_list_1754ea2c-37f2-464b-8d52-e9ead9768002.jpeg",
              "rating": "0",
              "numOfRating": "1",
              "description": "Your ultimate place for Beer, Pool ball, and chill hangouts. Bar Soccer is a Soccer themed bar with a snack counter concept. Apart from the usual broadcasting of live soccer matches, Bar Soccer showcases the latest trendy game from Germany - Pool Ball.",
              "review": [
                     "Good service. Attentive male staff :)",
                     "Great food, lovely staff",
                     "Good service and great food. 👍🏽",
                     "Service was good and staff was friendly! Food was decent and drinks were excellent, though portion sizes are a bit small.",
                     "Friendly servers!"
              ]
       },
       {
              "name": "Bar-beque @ Prinsep Street",
              "location": "Dhoby Ghaut",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5011685_list_3ae9dd2b-95c4-4f09-a9fd-e547f46e6c04.jpeg",
              "rating": "0.0",
              "numOfRating": "2",
              "description": "",
              "review": [
                     "Nice food!",
                     "Great meal. Good environment. Waitress very attentive and friendly.",
                     "Great ambience sitting by the river, friendly service, and good pork ribs!",
                     "Nice food"
              ]
       },
       {
              "name": "BBQ Box @ East Coast",
              "location": "East Coast",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5010895_list_ae382b21-3245-4600-adbf-6535a988ae15.jpeg",
              "rating": "0",
              "numOfRating": "0",
              "description": "Beats Bites & Cocktails is a contemporary lounge concept which places equal emphasis on the culinary, beverage and music elements in order to provide an experience where the sum is greater then its parts.",
              "review": [
                     "The seafood is fresh and there is a wide variety to choose from.",
                     "with the 50% discount it worth the deal",
                     "Service 10/10 Food 10/10 Worth it",
                     "Kopitiam setting. Food items very fresh. Got 50% discounts for 2pax and 20% discount for 3 pax on Sat night dinner buffet. Location a bit inconvenient, opposite Ikeas Tampines/Giant Hypermart Tampines. Staff very friendly. Table not big enough for the mookata setting. Buffet a lot variaty but no drinks. Need to get from drink stall.",
                     "The place is spacious and the service person are very polite and helpful to our request. Price is also very reasonable during this promotion period."
              ]
       },
       {
              "name": "BBQ Under The Stars @ Gallop",
              "location": "Sixth Avenue",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5011748_list_1d801523-05e9-4c07-a8b5-275120caf3e6.jpeg",
              "rating": "0.0",
              "numOfRating": "1",
              "description": "Brew House Sports Bar provides is a family friendly place which provides both indoor and part Al Fresco dinning options. Our menu is a mix of Western and North Indian food, carefully curated by our chefs. Try our Wings which ranges from No Spice to Ohhhh so spicy or our tandoor delicacies, which are made from scratch. Wash it down with a selections of draught, bottled beers or craft beers, sprits, sports  cocktails or mock-tails or soft drinks and juices.  There is always something for everyone. Watch the latest in trending sports on our 4 televisions while you indulge in our delicacies. It is truly a place where friendship and games brew.",
              "review": [
                     "Happy meal !",
                     "Service was good. Meat from buffet selection was not of good quality",
                     "Great food n services."
              ]
       },
       {
              "name": "Beats Bites & Cocktails @ Bukit Pasoh Rd",
              "location": "Rochor",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5012177_list_0fe0ea1b-7fa3-42b3-ae3a-afa6e032596a.jpeg",
              "rating": "0.0",
              "numOfRating": "1",
              "description": "Whether you're craving for zi-char or a seafood fiesta, you can get them at Buey Tahan See-food. This is yet another eatery for your seafood feast, but if you are dining here, you have to get their \"crab in da bag\" imperial pot.\n\nFor a filling dinner, top it off with their tantalizing hotplate sambal stingray, sweet and sour grouper and cereal prawns.",
              "review": [
                     "Nice interesting place to eat",
                     "It was a pleasant surprise to find Crab Cartel in Cold Storage. We ordered the burger trio which was very delicious and the soft shell crab pasta in pepper sauce. Simply enjoyed the food",
                     "The staffs are so kind. Easy to eat in. Casual. I prefer black pepper sauce than chili sauce."
              ]
       },
       {
              "name": "Bee Cheng Hiang Grillery @ Serangoon",
              "location": "Serangoon",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5003001_list_216f414e-bc01-4e65-86c3-6ae6fac85bdc.jpg",
              "rating": "0.0",
              "numOfRating": "10",
              "description": "Established in South Korea since 2014, Café de Paris has went on to become a renowned international franchise. Here in Singapore, they can be found at 313@Somerset, conveniently just above the Somerset MRT station. Specialising in desserts and light bites, visitors here must definitely try the mango bon bons, hot brownie or the banana toast. Its interiors are meticulously designed to ensure that just about everything here from every angle looks perfect on Instagram.",
              "review": [
                     "We enjoyed excellent food at the cafe. For the price paid, the service was also excellent. Thank you eatigo!",
                     "Great service and nice foods. Will come back again.",
                     "Best service - so friendly and prompt, attentive and frequently offering useful suggestions, such as which tea to have and which desserts would be great with our meal. Highly recommended!",
                     "The staff are friendly and the food selection are great and enjoyable.",
                     "The food was very good and was alway refill. Nice place to have buffet and the people are friendly."
              ]
       },
       {
              "name": "Blue Jasmine @ Holiday Inn Singapore Little India",
              "location": "Farrer Park",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/2806_list_a8e61888-ebb0-4f9d-b084-78cd2be4e41a.jpeg",
              "rating": "0.0",
              "numOfRating": "2",
              "description": "",
              "review": [
                     "Chef as usual excellent with his fine attention love and care to cooking, wonderful experience overall with great friendly services! Darbar will always be like a second home, dining!",
                     "Great service. Our go to place for our fave Indian dishes - fresh crunchy samosas, chicken tikka makhani, aloo gobi, naans.",
                     "Great and delicious!",
                     "Very good and tasty food.",
                     "Good food Great service"
              ]
       },
       {
              "name": "Brew House Sports Bar @ Sembawang Road",
              "location": "Sembawang",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5011989_list_9c08cf47-ede1-44a1-af7a-0e73bb06f482.jpeg",
              "rating": "4.4",
              "numOfRating": "21",
              "description": "One of Singapore’s oldest Mexican restaurants, Cha Cha Cha has been serving fuss-free Mexican food for over 20 years in Holland Village and Sixth Avenue. As you sip on a Mexican Mule or frozen Margarita on a hot day, consider their top-selling dishes to go with your fun drinks. The beef chimichanga and chicken quesadillas are perennial classics, while the crab meat enchiladas are a fun local twist on a Mexican fave.",
              "review": [
                     "The manager was very friendly and able to compromise our requests.",
                     "food is good. great value with Eatigo discount.",
                     "Excellent food. Too many nice food to recommend. Best to visit in a large group so that you can get to try more variety.",
                     "Excellent food and choices",
                     "Good service! Big portions and nice food… with eatigo discount is worth it"
              ]
       },
       {
              "name": "British Indian Curry Hut @ Holland Village",
              "location": "Holland Village (Road)",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/eatigo_BritishIndianCurryHut_20171012180421_6320.jpg",
              "rating": "0.0",
              "numOfRating": "9",
              "description": "",
              "review": [
                     "I will definitely recommend my friends over as the place is cool and quiet",
                     "Delicious dim sum, worth it with the eatigo discount! It’s self service in ordering and collecting",
                     "Food n cleanliness is good. But no crowd. Wondering why.",
                     "Self service tim sum house. Prices slightly pricey but more affordable after eatigo discount. Need to do some area cleaning coz the seats have lots of ladies' hair.",
                     "Efficient service"
              ]
       },
       {
              "name": "Brooklyn Bar Sg @ Ann Siang Road",
              "location": "Telok Ayer",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5012054_list_d816d1db-7328-464d-abcc-5d90544cd2b2.jpeg",
              "rating": "0.0",
              "numOfRating": "5",
              "description": "",
              "review": [
                     "Glad I was there for dinner. Dinner buffet is enjoyable and there's alot of variations to try. Very generous with the oyster when we went on 22nd Oct 2023. Staff is very helpful and efficient on that day.",
                     "Many varieties... many choices... great",
                     "good food & service",
                     "Service staff are nice and friendly, good spread of dishes",
                     "I enjoy the salad with freshly boil prawns. The delicious Seabass. Lovely cakes, Durian, chendol, \"Ah ta ji\", Red beans in coconut milk is a very special dessert Very attentive service. With great appreciation and love to all!"
              ]
       },
       {
              "name": "Buey Tahan See-Food x THAI BBQ @ Tampines",
              "location": "Tampines",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5011947_list_2d475d36-8115-43cd-8527-f6d00be7605a.jpeg",
              "rating": "0.0",
              "numOfRating": "0",
              "description": "Clover Plant-Based Kitchen and Bar is a trendy vegan restaurant situated at 18 Pahang Street in Singapore. This vibrant eatery specializes in offering a diverse and delicious menu entirely free of animal products. With a commitment to sustainability and ethical dining, Clover provides a delightful dining experience for vegans and plant-based enthusiasts, showcasing innovative and flavorful dishes that cater to a variety of dietary preferences. Whether you're a dedicated vegan or simply looking to explore plant-based cuisine, Clover Plant-Based Kitchen and Bar is a must-visit destination for wholesome, environmentally conscious food in the heart of Singapore.",
              "review": [
                     "Food is delicious with big portion.",
                     "Food is tasty but is expensive. Would not have gone there if without the 50% discount.",
                     "Cosy little cafe in HDB area, friendly service but slow. We ordered 2 pasta, food were tasty but portion a bit small, n were not hot when serving. Hope they can improve in these areas."
              ]
       },
       {
              "name": "Byblos Grill @ Bussorah Street",
              "location": "Bugis",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/2226_list_2f6662d9-4e19-4cc1-b773-ef0e4913726d.jpeg",
              "rating": "0.0",
              "numOfRating": "8",
              "description": "",
              "review": [
                     "Attending staff very polite",
                     "The ramen broth is delicious. Also ordered side dishes and mala skewers. Service was fast and experience was amazing. Thank you.",
                     "Great food. Friendly wait staff. Good experience",
                     "Side dish can be make tastier. The big intestine got a porky taste and tough which is not towards my liking.",
                     "Friendly staff with tasty food! Even dry noodle tasted great too!"
              ]
       },
       {
              "name": "Café 2000 @ M Hotel",
              "location": "Tanjong Pagar",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/1527_list_27bc1144-18d8-4395-b010-d522ffd1a08d.jpeg",
              "rating": "0.0",
              "numOfRating": "2",
              "description": "Experience the perfect blend of land and sea with our succulent crab burgers and delightful crab-infused pasta dishes. Join us for a coastal culinary adventure today.",
              "review": [
                     "Meativore platter is very yummy and very worth it after eatigo discount. It was an awesome meal",
                     "The discount is worth it. Nice atmosphere, but problem with car parking. Will be going there again soon.",
                     "Ordered Clam Chowder, Lamb Rack Half Slab, Aust Wagyu Ribeye, Iberico Spare Ribs, Sambal Stingray, Happy Hour 10 Glasses, Truffles Fries, Nachos with Cheese and a bottle of wine. Portion was very huge. Overall taste is good except a bit salty for the Sambal Stingray. They have a Karaoke upstairs and you can sing to your heart content till 12 midnight. Waiters and waitresses are very friendly.",
                     "Good food",
                     "iced americano and carbonara were tasty!"
              ]
       },
       {
              "name": "Café de Paris @ 313 Somerset",
              "location": "Somerset",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5004716_list_a712eae0-957a-4eeb-ab64-76c52cfecc05.jpeg",
              "rating": "0.0",
              "numOfRating": "0",
              "description": "",
              "review": [
                     "Menu selection is very limited but the friendly service from the staff and quiet ambience made the overall experience a comfortable one.",
                     "Great place to dine. Food is good although ala-carte menu selection is not a lot. Staffs are friendly. Good eatigo discount.",
                     "Staffs are friendly but choice of food is limited"
              ]
       },
       {
              "name": "CALI @ Raffles Place",
              "location": "Raffles Place",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5002197_list_1def11fc-878a-4111-8b8c-52f5c84b29e5.jpeg",
              "rating": "0.0",
              "numOfRating": "25",
              "description": "",
              "review": [
                     "Good food good service!",
                     "food was yummy but a bit slow in serving.. overall was good",
                     "Great food and service",
                     "Food is delicious and friendly staffs",
                     "Very good food and service!! will return for sure!!! thank you!!"
              ]
       },
       {
              "name": "CALI @ Rochester",
              "location": "",
              "imageLink": "https://cdn.eatigo.com/filters:format(jpeg)/eatigo_CaliRochester_20180410102551_7866.jpg",
              "rating": "0.0",
              "numOfRating": "8",
              "description": "While its name may sound strange in English, Dating Fish Music Themed Restaurant’s Chinese name sounds a lot nicer. Located along Mosque Street in Chinatown, the restaurant specialises in seafood. Featuring mostly creatively innovative dishes, top ones here are the tea fragrant shrimps, clam & crayfish with rice cakes, and their signature stone-steamed fish in cask.",
              "review": [
                     "All those invited by me were very pleased with the food and service. They are already checking out other branches near their home. Thanks you!"
              ]
       },
       {
              "name": "Canjob Taproom @ Tiong Bahru",
              "location": "Tiong Bahru",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/eatigo_CanjobTaproom_20180426190855_9517.jpg",
              "rating": "0.0",
              "numOfRating": "7",
              "description": "",
              "review": [
                     "Highly recommend for their Original Chicken menu!!!!",
                     "Items are fresh and deliciously made.",
                     "Love the sides, really decent quality Korean food, well worth the price!",
                     "Kimchi fried rice, japchae and chicken were all delicious. Kimchi pancake probably too sour for most people. Pleasant dining experience.",
                     "Food is good but on the pricey side without Eatigo"
              ]
       },
       {
              "name": "Cantina @ Arab Street",
              "location": "Bugis",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5011807_list_eba68e95-a46b-4596-bb37-4bf623349fe6.jpeg",
              "rating": "0.0",
              "numOfRating": "0",
              "description": "Dum Pukht Grill + Curry\n\n*Eatigo discount is not applicable for in-house promotion, special menu, drinks and alcohol ",
              "review": [
                     "The Indian food served was marvelous!",
                     "Food is delicious with nice view. There are many food choices. Value for money. Highly recommended.",
                     "Service staff are nice and friendly. Food is reasonable and good. But the complimentary cracker they gave prior to the food arrival is not too fresh and they soften within minutes. Perhaps the frying skills and the storage of the crackers play a very important part to this."
              ]
       },
       {
              "name": "Casablanca @ Arab Street",
              "location": "Bugis",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5011750_list_27eac512-d03d-45bc-8470-434c6e64eb0f.jpeg",
              "rating": "0.0",
              "numOfRating": "49",
              "description": "Behold a transformative dining experience as we redefine buffet-style. \n\nDelight your taste buds with unlimited servings of authentic Peranakan, local and international cuisines served straight from our kitchen to your table.\nGo on, indulge in all-time favourites such as la mian, black pepper tiger prawns, kueh pie tee, ayam buah keluak, artisan pasta with truffle cream sauce, seafood platter and more.",
              "review": [
                     "Love so much this Hard Rock Cafe and have in eatigo so so perfect"
              ]
       },
       {
              "name": "Harry's @ Angullia Park",
              "location": "Orchard",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/eatigo_HarrysAngulliaPark_20180504171157_2608.jpg",
              "rating": "4.0",
              "numOfRating": "3",
              "description": "From quality brews to accompanying delectable food, Harry’s has become synonymous with Singapore’s casual bar scene, having come a long way since its very first outlet at Boat Quay in 1992. Should diners get hungry, there are options like options like prawns & seafood aglio olio and light bites such as laksa popcorn chicken and their signature chicken wings. There are large-screen TV on the premises broadcasting live games, so friends can cheer on your favourite teams together.",
              "review": [
                     "Excellent service",
                     "Great service :)"
              ]
       },
       {
              "name": "Harry's @ Boat Quay",
              "location": "Boat Quay",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/eatigo_HarrysBoatQuay_20180504171245_3996.jpg",
              "rating": "4.8",
              "numOfRating": "45",
              "description": "From quality brews to accompanying delectable food, Harry’s has become synonymous with Singapore’s casual bar scene, having come a long way since its very first outlet at Boat Quay in 1992. Should diners get hungry, there are options like options like prawns & seafood aglio olio and light bites such as laksa popcorn chicken and their signature chicken wings. There are large-screen TV on the premises broadcasting live games, so friends can cheer on your favourite teams together.",
              "review": [
                     "Enjoyed the food. Service is good too.",
                     "Good food and service !",
                     "Enjoy the breeze outside, have a few pints over some bar bites, people watch or just enjoy live sports on the telly. Great evening out.",
                     "Bun on burger arrived overcooked and rock hard but it was quickly rectified by the kitchen. Fish and chips, fries, Harry’s salad and the margherita pizza were fresh and delicious. Thanks Harry’s for a great meal for me n my family!",
                     "The Service is great and accommodating."
              ]
       },
       {
              "name": "Harry's @ CHIJMES",
              "location": "City Hall",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/eatigo_HarrysCHIJMES_20180504171344_1494.jpg",
              "rating": "4.3",
              "numOfRating": "5",
              "description": "From quality brews to accompanying delectable food, Harry’s has become synonymous with Singapore’s casual bar scene, having come a long way since its very first outlet at Boat Quay in 1992. Should diners get hungry, there are options like options like prawns & seafood aglio olio and light bites such as laksa popcorn chicken and their signature chicken wings. There are large-screen TV on the premises broadcasting live games, so friends can cheer on your favourite teams together.",
              "review": [
                     "Although a good experience in general, perhaps a bit more training to the service staff and less reliance on the Supervisor would increase the overall efficiency during peak periods and enhance the patron satisfaction.",
                     "We sent back the satay because we felt the meat tasted strange, and possibly turned rancid. The staff immediately have it replaced and we had a fresh new batch.",
                     "location not so fantastic...surrounding under renovation."
              ]
       },
       {
              "name": "Harry's @ Clarke Quay",
              "location": "Clarke Quay",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/eatigo_HarrysClarkeQuay_20180504171502_2803.jpg",
              "rating": "4.5",
              "numOfRating": "36",
              "description": "From quality brews to accompanying delectable food, Harry’s has become synonymous with Singapore’s casual bar scene, having come a long way since its very first outlet at Boat Quay in 1992. Should diners get hungry, there are options like options like prawns & seafood aglio olio and light bites such as laksa popcorn chicken and their signature chicken wings. There are large-screen TV on the premises broadcasting live games, so friends can cheer on your favourite teams together.",
              "review": [
                     "Such a nice place for a simple first date..Not too fancy and just right!",
                     "Great food and cozy ambiance! eg. prawn pasta is delicious, so does chicken wings.",
                     "Waiter and waitress serving us are very attentive! They even informed us before proceed@Kitchen where the Main Dish we had ordered under Promotion Main Dish will not enjoy Eatigo Discount!",
                     "Good service & the food are served hot from the kitchen.",
                     "Great service"
              ]
       },
       {
              "name": "Harry's @ Cuppage",
              "location": "Somerset",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/eatigo_HarrysCuppage_20180504171545_1304.jpg",
              "rating": "4.4",
              "numOfRating": "43",
              "description": "From quality brews to accompanying delectable food, Harry’s has become synonymous with Singapore’s casual bar scene, having come a long way since its very first outlet at Boat Quay in 1992. Should diners get hungry, there are options like options like prawns & seafood aglio olio and light bites such as laksa popcorn chicken and their signature chicken wings. There are large-screen TV on the premises broadcasting live games, so friends can cheer on your favourite teams together.",
              "review": [
                     "The staff was friendly and helpful. The food was really yummy.",
                     "Good service by the team 😊",
                     "Service was good. Food was nice and portion was big. Will be back again!",
                     "simple and easy. also other than the platters the rest of the food (no drinks) is part of the discount which is great.",
                     "Food was good and service fast - will be back!"
              ]
       },
       {
              "name": "Harry's @ Dempsey",
              "location": "Dempsey",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/eatigo_HarrysDempsey_20180504171621_2746.jpg",
              "rating": "4.6",
              "numOfRating": "33",
              "description": "From quality brews to accompanying delectable food, Harry’s has become synonymous with Singapore’s casual bar scene, having come a long way since its very first outlet at Boat Quay in 1992. Should diners get hungry, there are options like options like prawns & seafood aglio olio and light bites such as laksa popcorn chicken and their signature chicken wings. There are large-screen TV on the premises broadcasting live games, so friends can cheer on your favourite teams together.",
              "review": [
                     "easy to reserve at eatigo.. food at harry’s is fantastic.. overall experience is awesome!",
                     "Grace is very helpful n accomodating. Great service.",
                     "A little warm (temperature) otherwise we enjoyed our meal and conversation very much.",
                     "Great burger & nice waitress!",
                     "Food was good but service was slow. It was a tuesday night."
              ]
       },
       {
              "name": "Harry's @ Esplanade",
              "location": "Esplanade",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/eatigo_HarrysEsplanade_20180504171715_5694.jpg",
              "rating": "4.0",
              "numOfRating": "1",
              "description": "From quality brews to accompanying delectable food, Harry’s has become synonymous with Singapore’s casual bar scene, having come a long way since its very first outlet at Boat Quay in 1992. Should diners get hungry, there are options like options like prawns & seafood aglio olio and light bites such as laksa popcorn chicken and their signature chicken wings. There are large-screen TV on the premises broadcasting live games, so friends can cheer on your favourite teams together.",
              "review": [
                     "Enjoyed the Jazz Burger but the french fries serving was a third the size from before sadly.",
                     "Love the food and the kind of service the staff rendered. It was excellent.",
                     "Elsa and rahim were great hosts! Kudos!!",
                     "The lady server was superb. Prompt in attending to our need. Even move me to a smaller table to enjoy the Soccer match while my family went shopping. Great services!",
                     "Staff was attentive and explained that under Eatigo, dining is 2 hours but if there’s no crowd waiting, we are welcomed to stay on. Food is value for money and on a week night, it was not too rowdy and it was a good place to catch up with friends. Thank you very much."
              ]
       },
       {
              "name": "Harry's @ HarbourFront",
              "location": "Harbourfront",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/eatigo_HarrysHarbourFront_20180504171908_4679.jpg",
              "rating": "4.7",
              "numOfRating": "70",
              "description": "From quality brews to accompanying delectable food, Harry’s has become synonymous with Singapore’s casual bar scene, having come a long way since its very first outlet at Boat Quay in 1992. Should diners get hungry, there are options like options like prawns & seafood aglio olio and light bites such as laksa popcorn chicken and their signature chicken wings. There are large-screen TV on the premises broadcasting live games, so friends can cheer on your favourite teams together.",
              "review": [
                     "The staffs are so friendly & attentive. We enjoyed our lunch there",
                     "Staff is very friendly and good experience in store.",
                     "Food is delicious and staff are friendly",
                     "Good service.",
                     "Food is good, definitely value for money"
              ]
       },
       {
              "name": "Harry's @ Holland Village",
              "location": "Holland Village (Road)",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/2973_list_1d78c5e3-2356-4b5f-82c9-d3f669b336dd.jpeg",
              "rating": "4.6",
              "numOfRating": "23",
              "description": "From quality brews to accompanying delectable food, Harry’s has become synonymous with Singapore’s casual bar scene, having come a long way since its very first outlet at Boat Quay in 1992. Should diners get hungry, there are options like options like prawns & seafood aglio olio and light bites such as laksa popcorn chicken and their signature chicken wings. There are large-screen TV on the premises broadcasting live games, so friends can cheer on your favourite teams together.",
              "review": [
                     "Service staff was professional. Introduced the happy hour drinks, left us to chat.",
                     "Service was pretty fast and staff were friendly. Highly recommended.",
                     "Service and ambience were good. Staff were very pleasant & helpful. With the eatigo discount it is a very good deal indeed! Will return for more!!",
                     "Live music with great food & company. Love the Eatigo discount too",
                     "Excellent Service!!"
              ]
       },
       {
              "name": "Harry's @ Mapletree Business City",
              "location": "Labrador Park",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/eatigo_dbdf5ddb62f65d9293511287317c5eb2_20180504171046_6923.jpg",
              "rating": "4.6",
              "numOfRating": "72",
              "description": "From quality brews to accompanying delectable food, Harry’s has become synonymous with Singapore’s casual bar scene, having come a long way since its very first outlet at Boat Quay in 1992. Should diners get hungry, there are options like prawns & seafood aglio olio and light bites such as laksa popcorn chicken and their signature chicken wings. There are large-screen TV on the premises broadcasting live games, so friends can cheer on your favourite teams together.",
              "review": [
                     "Service staff was very attentive.",
                     "Frequent this outlet many times. Always satisfied with the food and service.",
                     "Good food and great service",
                     "Was not crowded. Harry's is ok for food with beers. With a discount it is alright.",
                     "Food was hot and nice. freshly cooked. Lunch crowded but food arrive within 20 min. keep up the good work and promotion!"
              ]
       },
       {
              "name": "Harry's @ Marina Bay Link Mall",
              "location": "Raffles Place",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/eatigo_31aa0b456211530ab43dfddbc5e9ecff_20180504170602_7164.jpg",
              "rating": "4.6",
              "numOfRating": "95",
              "description": "From quality brews to accompanying delectable food, Harry’s has become synonymous with Singapore’s casual bar scene, having come a long way since its very first outlet at Boat Quay in 1992. Should diners get hungry, there are options like options like prawns & seafood aglio olio and light bites such as laksa popcorn chicken and their signature chicken wings. There are large-screen TV on the premises broadcasting live games, so friends can cheer on your favourite teams together.",
              "review": [
                     "Great value and casual jap dining",
                     "Very gd service and quality food that you can expect.",
                     "truffle buta don was a hit ! the pork chop was really nice too !",
                     "Great service and quality food ! will go back again soo",
                     "Hofuna is an absolute joy to dine at. Ordered Assari Nabe, Curry Chicken Katsu, Hofuna Special Ramen, Grilled Aji and Kinoki Batta. Finished off with a Pint of Sapporao draft. Everything pairs off nicely. No palate conflict."
              ]
       },
       {
              "name": "Harry's @ Novena",
              "location": "Novena",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/eatigo_74f69d5a5cc6fb15876cc673249a780f_20180504171130_2536.jpg",
              "rating": "4.0",
              "numOfRating": "0",
              "description": "Enjoy the warm ambiance, cityscape vistas, and attentive service as you unwind and create unforgettable memories high above the bustling streets. Whether celebrating success or simply seeking a relaxing evening with friends, Heaven at Seah St promises an elevated experience for all.",
              "review": [
                     "Value for money"
              ]
       },
       {
              "name": "Harry's @ Plaza Singapura",
              "location": "Dhoby Ghaut",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5010691_list_300e3828-14ce-49d6-b580-b1c8ba054b34.jpeg",
              "rating": "4.7",
              "numOfRating": "10",
              "description": "Discover Authentic Japanese Cuisine at Hofuna, Tai Seng\n\nStep into the world of genuine Japanese flavors at Hofuna Japanese Cuisine in Tai Seng. Immerse yourself in an elegant yet welcoming ambiance while savoring traditional dishes crafted with the freshest ingredients. From exquisite sushi and sashimi to captivating teppanyaki performances, Hofuna promises an unforgettable culinary journey that captures the essence of Japan. Let our skilled chefs and attentive staff guide you through a delightful experience that celebrates the rich heritage of Japanese cuisine.",
              "review": [
                     "Reasonable price. Good service and taste great. Highly recommended",
                     "Love the crispy waffle 🧇 and unique ice cream flavours.. Great place for chit chat..",
                     "Always love the crispy waffle 🧇. Ice cream flavours are unique and always a surprise as we never know which flavours they are serving.",
                     "nice waffle and ice cream",
                     "V v polite and nice staff"
              ]
       },
       {
              "name": "Harry's @ Resorts World Sentosa",
              "location": "Sentosa",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5007030_list_88a7dd46-efbe-4bd3-b40a-ed9e5c842f2c.jpg",
              "rating": "4.0",
              "numOfRating": "0",
              "description": "We have an extensive menu to cater to everyone. Be it you are a seafood lover or meat lover, you will be delighted and satisfied!\n\nJoin us here at House of Mookata!",
              "review": [
                     "Not the great food but not too bad either",
                     "Environment was ok ok but the food and service was superb"
              ]
       },
       {
              "name": "Harry's @ South Beach",
              "location": "Bugis",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/eatigo_5ade61a3eba72ef84f4da77fa9e64e64_20180504170752_5840.jpg",
              "rating": "4.0",
              "numOfRating": "3",
              "description": "We have an extensive menu to cater to everyone. Be it you are a seafood lover or meat lover, you will be delighted and satisfied!\n\nJoin us here at House of Mookata!\nSeats may vary to the restaurant's discretion. There may be a waiting period during peak hours.",
              "review": [
                     "Good recommendations. Nice ambient. Food is nice.",
                     "Good selection of food. Excellent Service staff",
                     "Friendly staff, foods not very fantastic on weekday as compared to weekend. They are either over seasoned but some are under.",
                     "All okay. As usual, the food was excellent!",
                     "Wide selection of lobster dishes"
              ]
       },
       {
              "name": "Harry's @ Tai Seng",
              "location": "Tai Seng",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/2961_list_0087f423-7948-4706-a794-af5c71395782.jpg",
              "rating": "4.0",
              "numOfRating": "0",
              "description": "Coming from Beijing China, the hottest Lobster/Crawfish restaurant, HUDA, now opens in Singapore. Our vision is to bring the best experience including taste and service for people in Singapore. The recipes, ingredients, and even chefs are from China.",
              "review": [
                     "The food is very delicious , the service is good and the price is reasonable. The ambience is conducive for conversations. It is an excellent place for quality food and quality conversation.",
                     "Excellent. Carbonara ↗️🆙👍",
                     "Jag Wine is an exceptional restaurant, the food is delicious, the service is exceptional, and the price is reasonable. It has been a delightful dining experience.",
                     "Food is delicious and service is good. The main course is at 50% as we made reservations through eatigo, so very worth it. My daughter ate the duck confit and mentioned that the meat is a little bit hard. I liked the bread with cheese and also the lamb shanks.",
                     "Great food good service"
              ]
       },
       {
              "name": "Harry's @ Tampines Grande",
              "location": "Tampines",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/eatigo_c86eae7cb23c056e8b76a8db8f593635_20180504170836_5895.jpg",
              "rating": "4.9",
              "numOfRating": "21",
              "description": "Looking for something to cool off from the heat in sunny Singapore? Icebar has all the ingredients you need to do just that. There is a variety of ice cream flavours, with options like Hokkaido milk with strawberries, Italian hazelnut and tiramisu. Don’t have a sweet tooth? Icebar also offers ice cold beers, the perfect beverage for days that get unbearably hot",
              "review": [
                     "Food and service was great",
                     "Delicious Korean food at very prices, even more amazing with 50% discount. Seafood pancake was crispy and delicious.",
                     "We had 6 generous portions of free appetizer dishes, crispy kimchi pancake with prawns, nice grilled meats, chewy ramyeon. Service is excellent."
              ]
       },
       {
              "name": "Heaven @ Seah Street",
              "location": "Bugis",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5011917_list_7ba1ed39-c71d-4207-92a4-c56e9c11babe.jpeg",
              "rating": "4.0",
              "numOfRating": "2",
              "description": "Indian Express is a casual and extremely welcoming restaurant in the heart of Little India on Race Course Road, where you’ll find exceptional flavors and warm hospitality. The menu is abundant in rich and authentic Indian dishes, using fresh ingredients to create a mouth-watering yet healthy feast. Be tantalized by crispy and golden appetizers, soulful curries, tandoori meats, fragrant biryani, plenty of vegetarian and vegan options as well as a great selection of Beer, Wines, Champagne and Alcoholic drinks to accompany your meal. An explosion of flavors await!",
              "review": [
                     "3rd visit here，dishes bit salty， rest all good.",
                     "food was nice.. but a bit slow.. staff is also very friendly",
                     "Environment is good but food wise a bit pricey",
                     "2nd visit here， food tasty as always. Will keep visiting untill promo ends.",
                     "Friendly n tasty"
              ]
       },
       {
              "name": "Hofuna Japanese @ Tai Seng",
              "location": "Tai Seng",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5011967_list_9c12405f-a32d-4dc8-af6d-277858ee6fe9.jpeg",
              "rating": "4.0",
              "numOfRating": "0",
              "description": "At Indline we offer Indian meals consisting of mean curries and phenomenal naans. Come and experience the comfortable and laid back atmosphere of a contemporary Indian cookery with a dynamic service option.",
              "review": [
                     "The Hokkien Mee was so delicious that we ordered second helpings. The staff were very friendly and polite."
              ]
       },
       {
              "name": "HolySmoke BBQ @ 9 Toa Payoh Industrial Park",
              "location": "Toa Payoh",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5011850_list_620d926b-c530-4408-a2ce-eaaa9527b2f1.jpeg",
              "rating": "4.1",
              "numOfRating": "11",
              "description": "J65 celebrates Singapore’s unique melting pot of cultures through a clear-cut passion for food. Rooted in an island nation in love with seafood, we deliver with panache, vibrance, and enthusiasm, eagerly displayed through our extensive buffet selections highlighting Singaporean specialties and international flavours.\n\nThe outlet boasts a variety of seats from booths, high tables to regular seating to fit all group sizes and occasions. To cap off the inclusivity, J65 is also halal-certified.",
              "review": [
                     "Friendly service and the food was great. We had the butter chicken and seekh kebab and chicken tikka. All pretty good and we will go back again.",
                     "Very good food and excellent service"
              ]
       },
       {
              "name": "House of Mookata @ 204 Bedok North",
              "location": "Bedok",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5012215_list_72b998bf-3618-4b15-9276-f67f9e7503ac.jpeg",
              "rating": "4.8",
              "numOfRating": "36",
              "description": "Featuring rustic wood-finished walls with candlelit tables, Jag Wine offers over 80 labels of wines from world-renowned vineyards, with choices for both Old and New World wines. The food menu is similarly plentiful, with options like braised lamb shank, angus fillet mignon and a premium cheese platter that’s perfect with wine. Not sure which wine to go for? Speak to the resident sommelier, who will be happy to make several recommendations for pairings based on your preferences.",
              "review": [
                     "No seat reservations, only show reservation code for 10%"
              ]
       },
       {
              "name": "House of Mookata @ Sengkang",
              "location": "Sengkang",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5011963_list_f001b531-91ee-417f-8dba-d74e92666708.jpeg",
              "rating": "4.0",
              "numOfRating": "3",
              "description": "Indulge in the rich and savory flavors of authentic Korean BBQ at Jun Korean Restaurant & Beer. Located in the heart of Biopolis, our restaurant offers a homely and casual dining experience that brings the best of Korean cuisine to your table.\n\nAt Jun, we take pride in serving MSG-free Korean food prepared with love and care. Our menu boasts a delectable array of marinated meats, fresh vegetables, and traditional Korean side dishes. You'll have the opportunity to grill your favorite meats right at your table, creating a truly interactive dining adventure.\n\nWhether you're a Korean food enthusiast or a newcomer to this delicious cuisine, Jun Korean Restaurant & Beer is the perfect place to savor the genuine taste of Korea in a warm and welcoming atmosphere.\n\nJoin us today for an unforgettable Korean BBQ experience that will leave your taste buds dancing and your heart feeling at home.",
              "review": [
                     "Very friendly staff"
              ]
       },
       {
              "name": "House On The Moon @ GR.iD",
              "location": "Dhoby Ghaut",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5012065_list_e6affc5b-6f46-4866-9050-ba39f286009d.png",
              "rating": "4.8",
              "numOfRating": "14",
              "description": "Craving Chinese skewers?\n\nHead to JiaYangDi on West Coast Drive (NEWest) for mouth-watering, authentic skewers grilled to perfection over an open flame. Choose from savory beef, juicy chicken, tender lamb, succulent seafood, and more. \n\nCome visit us and satisfy your skewer cravings today!",
              "review": [
                     "have a kids playground",
                     "Great food in a comfortable environment."
              ]
       },
       {
              "name": "Huda Restaurant Singapore @ Temple Street",
              "location": "Chinatown",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5010709_list_4151e9be-6651-4d6f-a384-3d16b67fb539.jpeg",
              "rating": "4.0",
              "numOfRating": "1",
              "description": "Kim's Singapore Bistro, located in Circular Road, is a culinary haven known for its best-selling local delights, especially the mouthwatering Hokkien Mee. Indulge in the rich flavors of this iconic stir-fried noodle dish, capturing the essence of Singapore's street food culture. Prepare to be enchanted by their authentic offerings and immerse yourself in the vibrant culinary heritage of Singapore.",
              "review": [
                     "I like their pizza! However, it’s worth noting that the eatigo discount doesn’t extend to beverages 😟. Their juice selections is priced ard $8++/glass. Their coffee is ard $4.50++. The staff are friendly. Thank you for your service!🙏🏻",
                     "Chef consistently makes good food, pleasant service staffs. Just hope for higher discounts on eatigo 4-6pm 🤪"
              ]
       },
       {
              "name": "Icebar @ Hougang",
              "location": "Hougang",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5009617_list_d036f433-7607-45b6-8372-91a26d831495.jpeg",
              "rating": "4.0",
              "numOfRating": "3",
              "description": "Kinara means \"river bank\" in Punjabi, so the fare is appropriately a mix of North Indian classics and some South Indian seafood specialties, particularly from the Kerala region. Each dish is dizzingly complex in flavour profile - as Indian cuisine is famous for - but none are overdone or exorbitant in price. You will find your favourite staples like naan and butter chicken, but if there's one Indian restaurant where you should push your menu boundaries, it's at Kinara. Try the Jhinga Biryani, with plump tender prawns and al-dente spiced rice or the Lucknowi Burra Kebab, with tender morsels of lamb. Heat-level can be tailored to your liking, but with truly great Indian food, the beauty is in the interplay of spices rather than the blunt spiciness.",
              "review": [
                     "Service is good, we love the food,it's filling",
                     "The best!!!",
                     "Worth the try restaurant and service is excellent! :)"
              ]
       },
       {
              "name": "Kurry Korner @ Changi Business Park",
              "location": "Changi",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5004595_list_a393fa87-3fe2-4661-a7d3-739531f48717.jpg",
              "rating": "4.3",
              "numOfRating": "5",
              "description": "Love your curry? You’ll be hard-pressed to find better than Kurry Korner. Their philosophy here is: we serve what we like to be served. This means that everything served here has no added MSG, artificial colourings and preservatives – just good food using fresh ingredients. Menu standouts here are the Lahori Kadai chicken, Tulsi Kadai prawns and their signature special chicken handi.",
              "review": [
                     "Food is delicious, service is too"
              ]
       },
       {
              "name": "Kwee Zeen @ Sofitel Singapore Sentosa Resort & Spa",
              "location": "Sentosa",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/2821_list_8ce7d25f-77c5-4e8f-b4e9-1b87b403331b.jpg",
              "rating": "4.0",
              "numOfRating": "4",
              "description": "Kwee Zeen is a modern, casual all-day dining restaurant. Featuring a total of 16 different ateliers to choose from, such as Live Seafood, French Stove, a Foie Gras Gallery, Fromage & Charcuteries, Tandoor, Chinese, dessert trolley, and a Chocolaterie that serves up handcrafted fresh truffles, cakes and confectionery. Diners will; be whisked away with the sumptuous offerings of Pan-Asian, western, French and local delicacies.",
              "review": [
                     "Relaxing ambience!",
                     "Delicious breakfast. Relaxed ambience. Excellent service. We had a wonderful Sunday morning outing!"
              ]
       },
       {
              "name": "L'Apéritif Lobby Bar @ Novotel Singapore on Stevens",
              "location": "Orchard",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5000490_list_ebd3ffb0-7b7f-46dc-922d-e6f4c5611f54.jpeg",
              "rating": "4.5",
              "numOfRating": "61",
              "description": "Hotpot in Singapore is always a joyful affair. Nothing gets better than close friends or family sitting around a pot of steaming hot broth with plenty of ingredients to satisfy everyone. At La Jiang Shan Hotpot, diners will always have a good time. There are both lunch and dinner buffets every day, allowing diners to enjoy all the food they want at one fixed price.",
              "review": [
                     "Well organise. Service was prompt. Only downside was the aircon was not too strong at the corner seat I was at. If not, it would have been perfect.",
                     "Excellent value for money, frien",
                     "Services is good..food is delicious..Will go again",
                     "It would be better lf the meal time can be extended",
                     "Very nice staff, pretty value for money"
              ]
       },
       {
              "name": "La Jiang Shan Hotpot BBQ @ Clementi",
              "location": "Clementi",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5009929_list_d756b254-bb3e-488d-a3a5-b8cab3b450b7.jpeg",
              "rating": "0.0",
              "numOfRating": "23",
              "description": "Hotpot in Singapore is always a joyful affair. Nothing gets better than close friends or family sitting around a pot of steaming hot broth with plenty of ingredients to satisfy everyone. At La Jiang Shan Hotpot, diners will always have a good time. Located at Parklane Shopping Mall along Selegie Road, there are both lunch and dinner buffets every day, allowing diners to enjoy all the food they want at one fixed price.",
              "review": [
                     "Still one of my favourite hotpot places 🤭",
                     "The service is good. Fast and accommodated. Just need to improve the ventilation!",
                     "Value for money hotpot & bbq buffet lunch. Most soup base are nice. My favorite is the Spicy Beef Mala, Hot & Sour Soup & Herbal Chicken Soup.",
                     "The herbal chicken soup is awesome! It's affordable~",
                     "Food is ok but the only problem is very hot inside."
              ]
       },
       {
              "name": "La Jiang Shan Hotpot BBQ @ Dhoby Ghaut",
              "location": "Dhoby Ghaut",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/3243_list_df904abd-3759-40bd-a601-48a7b193808f.jpeg",
              "rating": "4.7",
              "numOfRating": "8",
              "description": "Lazy Lizard offers some of the best Western Cuisine serving a tantalising collection of dishes that are suitable for family, large groups, catching up with friends and colleagues. From Chicken Wings to Burgers its extensive menu is reflective of the restaurant’s efforts to cater to every palate. This restaurant is located at NeWest and just a few minutes away from Clementi MRT Station. Let your hair (or tail) down and chill out at this cosy and laid-back restaurant for the young and old, the diligent and lazy. For once, live life like a lizard, slow down & unwind, here at Lazy Lizard.",
              "review": [
                     "We all enjoyed our mains order and had a great time together in a nice ambience. Music is slightly loud but given a good percentage off the cost of each order, we have no regrets! Highly recommended Lazy Lizard for all but best will be through eatigo where u can enjoy a discount which is pleasing to our pockets. Thank You Lazy Lizard..😜😲",
                     "The crab pesto pasta is delivious"
              ]
       },
       {
              "name": "Lazy Lizard @ Flora Vista",
              "location": "Ang Mo Kio",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5010164_list_0277f3ed-4feb-448a-b81e-bd1a7d118905.jpeg",
              "rating": "4.4",
              "numOfRating": "21",
              "description": "Lazy Lizard offers some of the best Western Cuisine serving a tantalising collection of dishes that are suitable for family, large groups, catching up with friends and colleagues. From Chicken Wings to Burgers its extensive menu is reflective of the restaurant’s efforts to cater to every palate. This restaurant is located at The Promenade @ Pelikat and just a 10 minutes away from Kovan MRT Station. Let your hair (or tail) down and chill out at this cosy and laid-back restaurant for the young and old, the diligent and lazy. For once, live life like a lizard, slow down & unwind, here at Lazy Lizard.",
              "review": [
                     "Service was very good. Rack of pork was delicious",
                     "The food came really fast and the restaurant server was friendly.",
                     "Great service and yummy food!",
                     "Food is nice. Service is good. Price is alright",
                     "Food was very good. Good deal with Eatigo"
              ]
       },
       {
              "name": "Lazy Lizard @ NEWest",
              "location": "",
              "imageLink": "https://cdn.eatigo.com/filters:format(jpeg)/restaurant-cover-image/5003068_list_5b526526-6862-4277-9df2-d66cc55d068b.jpg",
              "rating": "4.0",
              "numOfRating": "0",
              "description": "\"This chic bar is a cozy setting for meeting friends, relaxing with a drink and savoring the ambiance. Inspired by colonial-era pavilions, LeBar’s airy décor and plush furnishings invite you to linger over coffee and shared plates. At night, live music and bespoke cocktails transform it into a glamorous gathering place.\n\nRegardless of where you sit, the view enchants and delights. The panorama encompasses the lobby with its radiant blown-glass chandelier. Outside, the placid lawn pond, an indoor spa pond where tiny fish nibble on your feet, the aquamarine pool and South China Sea beyond.\"\n\nSavour a refreshing tropical high tea and bubbly in the heart of the resort with tranquil views of the lush outdoor palatial spaces and wafting sea breeze. Whilst the gentle breeze wafts in, sink yourself into the plush cushions ready for an afternoon of tête-à-tête amidst a delectable selection of patisserie and savouries, reminiscent of a tropical Balinese escape.\n\n$88++ for 2 persons with free-flow Nespresso Coffee OR TWG Tea (U.P. $45++ per person)\n\nTop Up Options\nSparkling Tea: $28++ for two glasses | $60++ per bottle\nChampagne: $36++ for two glasses | $88++ per bottle",
              "review": [
                     "Love the fresh and sustainable seafood, vegetables and herbs. Salad selection was delicious likewise with avocado and red pepper dips. Local Asian spread was also fabulous. Thank you!",
                     "staff was excellent too",
                     "Nice food, superb service!",
                     "Really good variety of food 😍😍😍",
                     "I think this restaurant requires a little more hygiene which is the reason why I rate four stars instead of five. Some serving plates n bowls were found to have stains but service was perfect"
              ]
       },
       {
              "name": "Lazy Lizard @ The Promenade",
              "location": "Kovan",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5004730_list_28da2203-1657-459c-a459-cb6e42fe967e.jpg",
              "rating": "0.0",
              "numOfRating": "43",
              "description": "",
              "review": [
                     "excellent service (can be a little slow but in no rush), enjoyable atmosphere",
                     "Great food , nice atmosphere"
              ]
       },
       {
              "name": "Lazy Lizard @ Upper Thomson",
              "location": "Upper Thomson",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5011840_list_ac874fed-2456-4d60-9c3d-28557c444159.jpeg",
              "rating": "4.0",
              "numOfRating": "2",
              "description": "Lobby Lounge & Bar is the perfect alcove to unwind after a day of sightseeing, shopping or work. Pamper yourself with the delightful high tea or simply enjoy a collection of tasty cocktails complemented with savoury snacks from our menu. Located in the Lobby. Open daily from 10.30am to 11.00pm",
              "review": [
                     "Excellent service",
                     "We had to wait a fair bit for service cos there was only 1 person, Ellen, attending to everyone before another personnel joined in. Food portions were reasonable. We absolutely enjoyed the chicken and mutton satay. The meat pieces were tender, moist and juicy on their own. The lobster brioche sandwich came with a generous helping of crispy fries. I would go back for the satay!",
                     "Service staff excellent",
                     "Great food and service from the staffs. Will be back in future. Thanks!",
                     "Best burger ever :)"
              ]
       },
       {
              "name": "LeBar @ Sofitel Singapore Sentosa Resort & Spa",
              "location": "Sentosa",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5008300_list_fd8f8112-91b2-4f0d-814f-fec698ab3d0a.jpg",
              "rating": "4.4",
              "numOfRating": "21",
              "description": "Bask in the old-world charm with an afternoon high tea amidst the natural daylight, textured stone floors and spacious layout of the hotel’s atrium lobby. Indulge in a lavish selection of dainty sweet and savoury treats accompanied with fine tea or coffee – perfect for a relaxing afternoon catch-up with family, friends or loved\nones.",
              "review": [
                     "Great place! Service is good and food is nice. Will come again!",
                     "Tasty food, excellent service.",
                     "Food was delicious! The steamed fish was so fresh and to top it off, great service!",
                     "Very good thai food at reasonable price with eatigo disct. My 2nd time here. All of us enjoy the god very much.",
                     "everything tastes good and delicious. but the shrimp was not very fresh."
              ]
       },
       {
              "name": "Lime Restaurant @ PARKROYAL COLLECTION Pickering, Singapore",
              "location": "Chinatown",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/2244_list_35e65269-682a-4fb3-b661-e7ade89ad71a.jpg",
              "rating": "4.6",
              "numOfRating": "53",
              "description": "Established in 2007, Lotus Thai offers a wide spread of traditional Thai cuisine at Jalan Besar. Diners can expect all the classic favourites here, including steamed seabass with lemon sauce, tom yum seafood fried rice and garlic chicken. Coming with vegan friends? No problem. Lotus Thai also has vegetarian options available. All these are available at wallet-friendly prices, so you don’t have to break the bank to enjoy quality traditional Thai food.",
              "review": [
                     "Good place, good food n good service.",
                     "Should have added some cut fruits in the buffet",
                     "Nice place, good food, good service",
                     "order satay & seafood lemak. satay not hot enough when serve & rice too soft, not recommended. Seafood lemak was good, taste like lasak. Soup, salad & drink was free flow. Overall recommended",
                     "Good place good service good food"
              ]
       },
       {
              "name": "Little Lazy Lizard @ Bukit Timah Road",
              "location": "Bukit Timah",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5005275_list_62a6be5d-03c6-4fc8-8f8c-5b590e6ac194.jpg",
              "rating": "4.2",
              "numOfRating": "23",
              "description": "Makan@Jen is a vibrant, eclectic all-day-dining restaurant offering a la carte and buffet options. With a variety of local, asian and international treats, you can fill your stomach and get back to exploring the city. Watch the bustling Orchard area below hum with activity from indoor or outdoor seating.",
              "review": [
                     "We have never tried Mediterranean food before. It is a nice experience. The waiter was very nice and friendly.",
                     "4 stars to get this published. Actually disappointed with my return visit. The pide was 'out of stock' as the chef felt unwell & went home! The bread that came with the mixed meze platter was different from the one we had previously, but waiter said it was the same. The Istanblue Kebab had only 1 lamb chop this time. I had to ask for the missing piece! The recommended beythi kebab chicken was unimpressive. I could not taste the chicken at all.",
                     "Actually, à two and a half star rating. Food is vastly different from former Istanblue time. Hummus, mutable and tsaziski were all very runny, shish kebab very dry and tough. Lamb chops still hold it's own. Service is good but food is really not up to scratch",
                     "Value for money with 50% discount, which is also applicable to kebab platter (that has 2 well-grilled lamb chops).",
                     "The service and food is good, is definitely worth the price, will come back again"
              ]
       },
       {
              "name": "Lobby Lounge & Bar @ Holiday Inn Singapore Orchard City Centre",
              "location": "Orchard",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5006800_list_4b17368e-9fb0-4c39-bd32-a19f1db6370b.jpg",
              "rating": "4.0",
              "numOfRating": "1",
              "description": "‘MANAM’ represents emotions far beyond words. Manam captures the sheer joy of food – from the faithful adherence to age-old home recipes to the careful curation of the freshest ingredients, from the pans of the finest chefs to plates of tantalising aromas that envelop the mind and soul.\n\nAt MANAM, we do not just serve great food – we create the ultimate South Indian experience of days gone by. Drawing from the rich culinary heritage of Tamil Nadu, Kerala, Karnataka, Belgaum, Andhra Pradesh, Goa and Telangana, MANAM invokes the nostalgia of rural South India – hand-crushed spices, sun-dried chillies, fresh farm animals, clear rushing spring water, the sounds of happiness and laughter across warm hearths and open doors.\n\nMANAM’s ethos is hospitality from the heart – great food on every plate that evokes wonder, joy, nostalgia and bliss with every bite. Naturally we do not use any artificial colouring or MSG, and we only use the freshest cuts of sustainably sourced fresh meat. Each dish is made to order, and we take great pride in being able to customise every plate for every palate.\n\nSo come visit us for the ultimate experience in South Indian non-vegetarian cuisine.",
              "review": [
                     "Great meal, fast service for lunch hour.",
                     "Always like the food here.. Good svc but some staff will act as if they can't see u waving.. And the only bad pointer was my seat was having aircon leaking. And staff don't let you choose your seat.. So I'm \"suffering\" there.....",
                     "excellent service rendered by the service team. Food served is of high standard and appetising",
                     "Food and service was good.",
                     "Great food & friendly staffs! Rmb to make reservation^^"
              ]
       },
       {
              "name": "Lobby Lounge @ Singapore Marriott Tang Plaza Hotel",
              "location": "Orchard",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5011581_list_85dd2ba3-c899-49a7-af1c-a9f6f17bcc30.jpeg",
              "rating": "4.1",
              "numOfRating": "9",
              "description": "Housed in the mecca of Middle Eastern delicacies at Baghdad Street, Istanblue Mezze & Grill House will tantalize your taste buds with their wide range of Turkish culinary delights. As the name suggests, the interior is decked out with a calm blue hue, reminiscent of the beautiful Mediterranean. The menu offers Turkish charcoal grilled meats such as Lamb Shish and Patlican Kebab. To cap off your meal, try the Sutlac: a traditional cool and creamy Turkish rice pudding dessert.",
              "review": [
                     "Nice & delicious dishes. Highly recommended",
                     "We had 2 flavors Fishpot. It taste so good. Fish taste soft and flavorful. Waitress very attentive to customer.",
                     "tasted the mandarin, tasty and nice & the staffs are very friendly too:)",
                     "Great service and friendly people",
                     "Friendly staff always! Yummy food"
              ]
       },
       {
              "name": "Los Amigos @ Boat Quay",
              "location": "Boat Quay",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5011626_list_e53ff6b8-067f-4930-95f7-8aebc3451464.jpeg",
              "rating": "4.2",
              "numOfRating": "8",
              "description": "We take pride in bringing you the best of French Artisan Culinary &\ntraditional Japanese cooking arts. premium selection of ingredients\nand exceptional culinary execution by our chefs, we expect our customers\nto say ‘Miam!’ (Yum!) with every mouthful bite.",
              "review": [
                     "Food is fresh and service is good",
                     "The food come with sufficiently large portion yet not too much. Only select items are under promotion. The Peking duck is delicious.",
                     "We always enjoyed a good value for money lunch menu using Eatigo Apps .Thank u for the good n attentive services by all their staffs in Mouth Restaurant especially Miss Wendy.",
                     "Always an enjoyable dinning experiencein Mouth Restaurant for their good services, nice food and value for money menu. Special thanks to Yvonne, Raymond, Ong for their good services at all times.",
                     "Highly recommended for their delicious food, good services and reasonable price menu especially great discount using Eatigo apps."
              ]
       },
       {
              "name": "Lotus Thai @ Paya Lebar Square",
              "location": "Paya Lebar",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/2739_list_f367d9d4-c5c2-468f-a9c1-7da73f4aa61a.jpg",
              "rating": "4.4",
              "numOfRating": "21",
              "description": "Walk into an all new steamboat concept - Ming Tang Spicy Roast Fish. With multiple flavours to choose from, there will be something for everyone. Try out their hot favourites - Green Peppers Grilled Fish and Fragrant Onion Grilled Fish.",
              "review": [
                     "Great. fast service"
              ]
       },
       {
              "name": "Makan @Jen at JEN Singapore Orchardgateway",
              "location": "Dhoby Ghaut",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/960_list_14f2dc7c-e523-4b85-8120-48c5965c7cfc.jpeg",
              "rating": "4.5",
              "numOfRating": "53",
              "description": "Established since 1988, the Mouth Restaurant specialises in traditional and authentic Cantonese cuisine. Designed to cater to both intimate affairs to large celebratory events, their kitchen specialties include sautéed carrot cake in XO sauce, tenderloin beef cubes in Kobe sauce and mini Buddha Jump Over the Wall. If you prefer dim sum, there is a wide selection of over 100 choices.",
              "review": [
                     "Great food, great service… lovely place to celebrate my birthday. Unfortunately, the restaurant was too warm. Time to upgrade your air conditioners.",
                     "Just focus on the Pho and you will not be disappointed.",
                     "A hidden gem indeed. Food is yummy and portion is good. Lady who served us was attentive and provided good service. One suggestion to your Banhmi is to use pickled veg to enhance the taste.",
                     "The food was great but the place is hard to get to.",
                     "Great place n nice food. Flexible to start earlier, 15mins before actual. Good deal too"
              ]
       },
       {
              "name": "Man Dang Dang BBQ @ Geylang Road",
              "location": "Geylang",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5007033_list_65d2071f-7ea1-4599-ad43-71424b488982.jpg",
              "rating": "3.7",
              "numOfRating": "6",
              "description": "Mookata - Thai BBQ\nServing 4 types of special homemade chilli sauce, authentic from Thailand!",
              "review": [
                     "Staffs were very polite and provided great service. My girl and I enjoyed the food very much. Definitely going back for more food.",
                     "Though the beer selection is limited, the food is good!",
                     "The laksa pasta is great. Salted fried lotus was not crispy but rather chewy though. Fish and chips was normal though.",
                     "They have an extremely polite and friendly staff who elevate the experience. Menu is a bit limited but food is tasty. Will definitely go back as the 20% discount is available for walk ins too."
              ]
       },
       {
              "name": "MANAM @ Boat Quay",
              "location": "Clarke Quay",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5010294_list_50223af5-7777-4665-bdeb-d66295f8c62d.jpeg",
              "rating": "4.3",
              "numOfRating": "6",
              "description": "Get a taste of authentic Vietnamese cuisine in Singapore with Mrs Pho. As a tribute to all the Vietnamese mothers, grandmothers and aunties whom we affectionately crown the best cook in the family, Mrs Pho aims to be a place to feed everyone like family.",
              "review": [
                     "Hi, The food was ok. I ordered south Indian food but was getting some weird oil smell from the dosa and it was also a bit oily.",
                     "Good food & nice location",
                     "The restaurant did not honour the $5 discount coupon used on my booking. They advised ignorance on this.",
                     "Simply loved it will repeat again Very smooth eatigo booking and excellent customer support.",
                     "Good location, friendly staff Rave masala dosa really good Will go back"
              ]
       },
       {
              "name": "MAVI Restaurant & Grill @ Kampong Glam",
              "location": "Bugis",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/eatigo_IstanBlueTurkishMezeampGrill_20181005113307_9733.jpg",
              "rating": "4.8",
              "numOfRating": "4",
              "description": "Come and experience the culinary delights in a cozy ambiance in the east.",
              "review": [
                     "Yummy food as usual. Happy with the 30% discount",
                     "Great location, great food, reasonable price",
                     "Nice food n good service.tks",
                     "Delicious meal always!",
                     "Our company of 4 ordered 3 appetizers, 4 main courses, fried rice and millet porridge. All were good. We had a good seat with privacy, that was comfortable although harder to call for service. Overall it did not disappoint. For the price, I thought it was really very value."
              ]
       },
       {
              "name": "Max's Restaurant @ Far East Plaza",
              "location": "Orchard",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5011421_list_74585da9-aff8-4f7e-a9a3-d03235747483.jpeg",
              "rating": "4.0",
              "numOfRating": "0",
              "description": "Enjoy a Thai-licious meal with us! Come to Nakara Thai Cuisine!",
              "review": [
                     "We ordered a platter with seafood. The prawn and sotong were fresh. Meat and fish were marinated well. Even with the eatigo discount, we can order the buffet. Also kudos to the staffs, patient and helpful.",
                     "considerate stall owner who attends to serve nicely with care. Been here a few times and the best value every mookata fan cannot afford not to experience",
                     "Good food. Great price.",
                     "Boss was very friendly and generous with food. Even gave us dessert and extra portion of meat 👍🏻",
                     "Food is nice and fresh, recommended"
              ]
       },
       {
              "name": "Miam Miam French Japanese Cafe Kitchen @ Westgate",
              "location": "Jurong East",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5011951_list_5703dd28-49e8-4c5f-b41e-1c14e365fe2e.jpeg",
              "rating": "4.2",
              "numOfRating": "6",
              "description": "NALAN is a legendary chef and king from Indian mythology, famed as much for his righteousness as for his culinary skills. NALAN is not just the inspiration for our name, but it also defines the underlying ethos of our food: freshly made-to-order, using the finest ingredients, and maintaining the authenticity of the original time-honoured recipes from North and South India.\n\nOne of the Singapore’s leading vegetarian restaurants, NALAN specialises in incredibly healthy preparations filled with the best of nature’s goodness, while still pandering to all the five senses. The love and attention we lavish upon every serving rejuvenates your body and mind, and our carefully curated menu tantalises the palate with its amazing variety of Indian vegetarian cuisine from all across the sub-continent .NALAN’s skilled chefs are able to accommodate almost any dietary restrictions or food allergy without sacrificing taste or quality.\n\nSo come on down to NALAN, and let the real flavours of India permeate your very soul. Eat Healthier, Be Happier and Live Longer!",
              "review": [
                     "good variety of food, excellent service",
                     "Good value for money. The place is clean, and good selection of food",
                     "Manuel is very accommodating and helpful",
                     "Very good price with Eatigo discount! Family were very happy with the choice of foods and overall the dining experience was good and enjoyable. :)",
                     "Interesting buffet with a mix of seafood and meats. An extensive choice of foods and at a great price."
              ]
       },
       {
              "name": "Ming Tang Spicy Roast Fish @ Bugis #01-03",
              "location": "Bugis",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5005936_list_141a133e-2c68-462c-a958-fcc6db1589ce.jpg",
              "rating": "4.5",
              "numOfRating": "56",
              "description": "Diners in search of 100% authentic cuisine from Nanjing need look no further. A popular chain restaurant in China, this is Nanjing Impressions’ first foray into Singapore, offering a variety of dishes in this classic cuisine style. Located at Plaza Singapura, the kitchen here serves dishes like Madam Chiang’s nutritious beauty porridge, chilled drunken virgin red crayfish and their signature Jinling salted duck.",
              "review": [
                     "Eatigo APP sucks. The click button didn’t work. I couldn’t cancel the reservation half an hour before appointment time. And the button also didn’t work for live agent chat. I would be surprised to get a follow up call on this feedback. I guess Eatigo is dying and will be closed down soon. The restaurant’s address was also not updated after several reminders from the restaurant for the past many months."
              ]
       },
       {
              "name": "Mitsu Sushi Bar @ Duxton Road",
              "location": "Duxton Road",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/2662_list_ad4f4044-5392-4b2c-8989-413ae9a11b57.jpg",
              "rating": "4.8",
              "numOfRating": "31",
              "description": "Alacarte, Platters & Buffets, we cater to everyone's appetite. Come enjoy quality mookata with your friends and family!",
              "review": [
                     "1 word: SHIOK! Their Pesto pasta and Crab Meat Risotto is absolutely pleasing to the palate. If you need a bit of additional kick, adding a few drops of Tabasco sauce would elevate the flavours further. Unfortunately, they have taken their signature curry series off the Eatigo list.",
                     "Very nice pasta alio olio and ariabiatta. Good beer happy hour promo. Aircon could work a bit better though",
                     "Great food and value for money… nice atmosphere too",
                     "The seafood pasta was very good. Risotto was okay . The vongole pasta was a little bland, not as good . Service was great, but some items were not available probably due to last 1.5hrs before closing. Overall, nice deal .",
                     "Affordable and nice!"
              ]
       },
       {
              "name": "Mouth Restaurant 地茂馆 @ Maxwell Road",
              "location": "Chinatown",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5005183_list_80168ea4-e6f4-4f88-a7e3-f1bb6d9c981c.jpg",
              "rating": "4.0",
              "numOfRating": "1",
              "description": "Beppu Menkan prides itself as one of the best spicy fried chicken ramen in town. Its name, ‘Beppu’, is where its cuisine is inspired from – a city within Kyushu, Japan. Located at China Square Central near Telok Ayer MRT station, the restaurant’s top dishes here include the char siew ramen set, beppu ramen, and their signature fried chicken ramen set.",
              "review": [
                     "Service is good.",
                     "The food is yummy. Service is okay. But not everything things with a 50% discount. (steaks don't have )",
                     "Service kind of lacking as staff weren't attentive. But food was amazing.",
                     "Repeat visit and happy with the quality of the food and service",
                     "Nice food & great service, especially by Rose & Saiful"
              ]
       },
       {
              "name": "Princess Terrace Authentic Penang Food @ Copthorne Kings Hotel",
              "location": "River Valley",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/eatigo_186f59e36c9cb4a5337f4b92a3a7dc39_20180910145459_7660.jpg",
              "rating": "0.0",
              "numOfRating": "2",
              "description": "At Yi Pin Ju Chinese Restaurant, we believe that great food brings people together. Come join us and experience the essence of Chinese cuisine in the heart of Tanjong Pagar. Our doors are open, and our kitchen is ready to delight your taste buds. \n\nDiscover Tradition. Taste Excellence. Create Memories.",
              "review": [
                     "Nice find in eatigo! Dishes were tasty, location at CBD area.",
                     "The dishes are nice and price is reasonable. I ordered 5 dishes to try, all quite nice. The environment is cozy and full air-conditioning, good for gathering event. The restaurant boss is friendly and give discounts to try dumplings. Well worthy for money spending."
              ]
       },
       {
              "name": "一品居中餐厅 Yi Pin Ju Chinese Restaurant @ Tanjong Pagar",
              "location": "Tanjong Pagar",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5012110_list_dc8e6b6e-2edd-428e-85df-9a27df8e4b97.jpeg",
              "rating": "4.0",
              "numOfRating": "0",
              "description": "Offering both authentic French Cuisine and Local Chinese Delights. Connoisseurs of gourmet experiences will enjoy a menu of traditional French classics and timeless Chinese dishes all prepared by two distinct culinary brigade at four live cooking stations. Racines offers a plethora of epicurean delights that are crafted and catered to various dietary needs including health-conscious Delight dishes. Embark with us on a culinary journey of flavours spanning the breadth and depth of Singapore and France, for an unforgettable epicurean experience.",
              "review": [
                     "nice food and friendly staff!",
                     "Great food and service! Thanks for making me feel at home!"
              ]
       },
       {
              "name": "Racines, Sofitel Singapore City Center",
              "location": "Tanjong Pagar",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5011187_list_6520ed40-dfbe-4091-8e6b-7fa07b9a108c.jpeg",
              "rating": "3.7",
              "numOfRating": "5",
              "description": "Rangooli Restaurant is a traditional North Indian restaurant, nestled in the heart of West coast since the 1990s.\nOn top of a serene and quiet ambience, we host authentic North Indian cuisine brought to you by our chefs who hail from Northern parts of India.\nOur chefs bring flavors and techniques from India that translates into the various vegetarian and non-vegetarian dishes that we provide.\nWe promise you, not only a pleasant dining experience, but also a tantalizing experience for your taste buds.\nPlease join us and allow us the opportunity to serve you with tasteful North Indian cuisine at Rangooli Restaurant.",
              "review": [
                     "Food quality very good, they need to focus more on ambience. A couple of plates were cracked and there were flies roaming around food"
              ]
       },
       {
              "name": "Raku Inu Bistro & Bar @ Flora Vista",
              "location": "Ang Mo Kio",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5011846_list_02aef787-5dbb-4028-8218-12154828ef5c.jpeg",
              "rating": "4.0",
              "numOfRating": "3",
              "description": "Red Chilli-The Bollywood Spices is a halal-friendly restaurant serving freshly cooked Indian dishes that are bound to delight you.",
              "review": [
                     "Cosy ambience, tasty food...cajun fish, grilled prawns, satay, carrot cakes, naan, n red velvet cakes dessert. Staff were friendly and attentive, live band was great also.. My family had an enjoyable time there. Thank u...",
                     "Prompt and friendly service. Indian and Malay food were tasty. Ambience was good.",
                     "Food was Amazing 👏 Thank you",
                     "I found the crab dish not so fresh. The rest of the foods are good. Hope you can improve on the food mentioned. Thanks",
                     "50% off promotion is a good deal, but the choice of drinks are limited, can have more non- spicy food choice, desserts are almost run out for late lunch dinner."
              ]
       },
       {
              "name": "Rangooli Restaurant @ Clementi",
              "location": "Clementi",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5011586_list_f2c53faa-3a16-4663-b6a6-b977a42c7adc.jpeg",
              "rating": "4.0",
              "numOfRating": "0",
              "description": "If you love avocado, this is the perfect place for you. As its name suggests, Renew Deli | Avocados & Acai serves all things avocado. Located within SAFRA Tampines, the bistro offers items like avocado sandwiches, avocado toast and granola acai bowls, which of course comes with avocado. It’s a comfortable laidback place to come by with your friends, so feel free to bring them along to get your fix.",
              "review": [
                     "Great food, good service. Will definitely visit them again.",
                     "All of the staffs are so friendly and helpful to decidethe menu. I enjoyed talking and delicious food. Thank you for your kind services.",
                     "We are simply wowed by the food and the quality of it.",
                     "The buffet deal is a steal at 50% off. Portions are small which is perfect for tasting."
              ]
       },
       {
              "name": "Red Chilli-The Bollywood Spices @ Changi Road",
              "location": "Kembangan",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5010932_list_f030f966-539b-405f-a8a8-ee62637484af.jpeg",
              "rating": "4.0",
              "numOfRating": "0",
              "description": "Robey Mookata @ 7 Keppel Road #01-12 is a cosy dining place for friends and family gatherings.  We provide both indoor air-conditioned & outdoor dining options and can host large group gatherings. Apart from Mookata, we also offer a wide range of soft drinks and freshly brewed drinks such as the Authentic Thai Red Milk Tea, Thai Green Milk Tea and Lemongrass.",
              "review": [
                     "Cosy and friendly atmosphere"
              ]
       },
       {
              "name": "Rehash Gastrobar and Cafe @ Tyrwhitt Road",
              "location": "Jalan Besar",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5012136_list_bc4a5972-5375-4cd5-bd20-841c4890a7ed.jpeg",
              "rating": "4.2",
              "numOfRating": "12",
              "description": "With well appointed interiors surrounded by scenic greenery, Orchid Country Club makes for an ideal venue for both intimate meals and large celebratory events. This atmosphere is also upheld within Royal Palm, where guests can look forward to a wide array of international cuisine. Appealing options include butter chicken, daging rendang and chilli crab. Bringing your Muslim friends? Worry not – Royal Palm is a 100% Halal establishment certified by MUIS.",
              "review": [
                     "Good food and service.",
                     "Great food and Very good customer service!",
                     "We've discovered Great Mediterranean cusisine. You can enjoy the view which is amazing. The best part is the great service with the staff doing an excellent job. We look forward to come back to enjoy the the platters and one of our favourites cheeze bureks. For those with a sweet tooth you should try kunefe",
                     "Good food, great staff.",
                     "Same as always… very good food and nice place to dine along the river"
              ]
       },
       {
              "name": "Renew Deli | Avocados & Acai @ SAFRA Tampines",
              "location": "Tampines",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5006548_list_35d505fa-b3e0-47eb-9a21-1f45663ecaa7.jpg",
              "rating": "3.8",
              "numOfRating": "9",
              "description": "Established in 2009, RUBATO @ Greenwood is one of Singapore's oldest and most prestigious Italian restaurants. Renowned as a cult favorite, it attracts celebrities, ministers, and influential business figures seeking an unforgettable dining experience.\n\nSetting itself apart as the latest opening fine food and gourmet restaurant in Singapore, RUBATO welcomes diners until 2 am for both dine-in and delivery. Craving pizza, pasta, burgers, or steaks at 2 am? Look no further.\n\nWith a menu that combines classic Italian dishes and contemporary culinary creations, RUBATO satisfies all palates. Immerse yourself in the flavors of Italy, even in the late hours, and experience the culinary magic of RUBATO @ Greenwood.",
              "review": [
                     "Big and fresh prawns",
                     "Return customer - Laksa soup is very nice. Staff is friendly and attentive. Food is fresh and environment is very clean. Highly recommend",
                     "Good food",
                     "Laksa is good"
              ]
       },
       {
              "name": "Robey Seafood Mookata @ Tanjong Pagar",
              "location": "Tanjong Pagar",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5012059_list_1149bd3f-e4ed-49b4-8ca0-571156341094.jpeg",
              "rating": "0",
              "numOfRating": "2",
              "description": "Dark wood, leather upholstery, and industrial design touch, Rumpoles Bar boasts the perfect vibes of a modern gentleman's club to dine and chill with your loved ones. \n\nEnjoy delectable food at this cosy space situated right within Hotel Jen Tanglin.",
              "review": [
                     "Boss is friendly and food is good. Best of both world",
                     "glad there was eatigo discount 30% on the food",
                     "Delicious food & good service. Clean & good ambience. Will go again!",
                     "Yummy food, bright & nice environment, excellent service staff. Will be back again!",
                     "Good food n service My friends enjoyed the meal very much Will be inviting others to dine here"
              ]
       },
       {
              "name": "ROUTE 65 Bar & Cafe @ Ubi Techpark",
              "location": "Macpherson",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5011915_list_9b5c18a9-546a-4869-8ab4-8371749745ce.png",
              "rating": "4.7",
              "numOfRating": "16",
              "description": "For more than a decade, Sahara Bar and Restaurant has been delighting visitors with its relaxing ambience set against the charming backdrop of the Singapore River. Set up by former S. League Soccer Player, Esad Sejdic, Sahara not only serves up scrumptious Mediterranean and Persian cuisine, it also serves special Balkan favorites such as Cevapcici and Burek!nTrue to the passion of a sportsman, Sahara also regularly screens live soccer matches and other sports on its many TV screens! Drop by for a taste of delicious char-grilled kebabs and ice-cold beer while catching your favorite sports on TV!",
              "review": [
                     "Agree with reviews that food is very tasty, portions are small. Special mention to the excellent service standards at this outlet - very alert, attentive, efficient & friendly staff.",
                     "Will dine again",
                     "Have been to the restaurant few times, food is good. With Eatigo discount, very worth it.",
                     "Yummy hokkien cuisines. Perfect for family gathering or celebration. Service crew is attentive and friendly!",
                     "Great food and good service. Love the braised trotter, the corn fish and many more. With eatigo discount is really worth it. Thanks."
              ]
       },
       {
              "name": "Royal Palm @ Orchid Country Club",
              "location": "Yishun",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5005282_list_076c17b3-69f5-4316-a9d3-d98cd6e86cbe.jpeg",
              "rating": "4.3",
              "numOfRating": "7",
              "description": "Located on Kitchener Road, Laksa Steamboat offers a unique fusion of laksa and steamboat. With a cozy ambiance and signature laksa broth, it's a delightful culinary experience that combines interactive dining and rich flavors.",
              "review": [
                     "Portion are huge and delicious",
                     "Taste of meat not too bad. Portion cld be more. Can hv more side dishes. Lettuce shld b bigger pieces to wrap meat. Hv to do online feedback for ice cream. Drinks & premium items not available for 50%. Cld serve iced tea like what most Korean restaurants do. Taste of kimchi & cucumbers, macaroni salad & pumpkin can b improved. Cold noodles clumpy. juz giving suggestn hw to improve food to improve biz. May still come back for meat. Pricing okay after 50% disc.",
                     "Easy transition. Food are delicious. So far so good. Like it",
                     "Good food.",
                     "Pleasant experience. Value for money after discount."
              ]
       },
       {
              "name": "RUBATO @ Greenwood",
              "location": "Bukit Timah",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5011746_list_90d3e42e-198e-4cd2-85ec-ef59c8888916.jpeg",
              "rating": "4.3",
              "numOfRating": "10",
              "description": "Experience the greatest trio of life - comfort food, people and conversations. The soul of San Ren Xing lies not only in serving up culinary delicacies but a place for social interaction and comfort. Though deceptively presented with a simple aesthetic, the dishes achieve sublime perfection with impeccable ingredients, through meticulous and often time-consuming preparations. A meal at San Ren Xing offers diners comfort food outside of the hustle and bustle.",
              "review": [
                     "Food was good, staffs were attentive. One of our favourite Korean food joint.",
                     "We love the food, the meats was great and the frequent change of the grill. My only complaint is that the lettuces are drenched wet making it unappetizing to use as a wrap. We have informed the waitresses about it. Hopefully they shake out the water next time. Also the music could be a little less pounding. Otherwise, my monthly go to for a kbbq beef fix. Love the ribs!",
                     "food was good and value for money with the discount",
                     "excellent food quality and good service staff",
                     "Staff are patient despite being short handed during their meal time. Like the free flow of lettuce, kimchi,garlic etc to go with the bbq meat and also like the pancake. The only complaint is the aircon not strong"
              ]
       },
       {
              "name": "RUBATO STEAKHOUSE @ Teck Lim Road",
              "location": "Outram Road",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5011747_list_033a3111-f950-4f05-a7c8-28f2718b6aee.jpeg",
              "rating": "0.0",
              "numOfRating": "27",
              "description": "Experience the greatest trio of life-comfort food, people and conversations. \nThe soul of San Ren Xing  lies not only in serving up culinary delicacies but a place for social interaction and comfort.\nThough deceptively presented with a simple aesthetic, the dishes achieve sublime perfection with impeccable ingredients, through meticulous and often time-consuming preparations.\nA meal at San Ren Xing offers diners comfort food outside of the hustle and bustle.",
              "review": [
                     "Enjoyed the food! Multiple times there alrdy",
                     "We ordered premium pork, pork jowl, spicy chicken and they were well marinated and tasty. The kimchi and raw lettuce are self service and are fresh. Service is quite good, we had a good experience overall. Definitely will return again.",
                     "Good food, pleasant service and nice ambience. The Samgye-tang, and Gyeran-jjim is splendid!",
                     "Reasonably priced for the service and meat n good charcoal used. Pleasant experience. Mgr Freddy is nice and helpful too. Overall good service",
                     "Value for money with the 50% discount applied and love the free flow of side dishes"
              ]
       },
       {
              "name": "Rumpoles Bar @ JEN Singapore Tanglin by Shangri-La",
              "location": "Tanglin",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5012053_list_55b2f3e9-4de3-40c6-b92d-0d3cc41a4b61.jpeg",
              "rating": "4.0",
              "numOfRating": "0",
              "description": "At SanSara, we invite you to embark on a gastronomic voyage, a journey through time and tradition, where the flavours flow harmoniously, and every dish tells a story. As you dine with us, you become a part of this eternal flow, experiencing the essence of India's culinary heritage and the ever-evolving tapestry of flavours that it offers. \n\nSanSara is more than just a restaurant; it's a celebration of the endless flow of life, culture, and cuisine.\n\nCome experience the authentic Northern Indian cuisine by the Singapore River today!",
              "review": [
                     "Food is nice although overly priced. If not given 50% will not ho there. With the amount can go for better buffet meal.",
                     "Service is great. Patient and willing to explain how to order and match the bbq for good food. Food is great too. Thanks.",
                     "Repeat visit. But seems serving portion for 50% is a bit smaller?",
                     "Nice food with the 50% discount",
                     "Food is still great but service can improve."
              ]
       },
       {
              "name": "Sahara Bar & Restaurant @ Boat Quay",
              "location": "Boat Quay",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/eatigo_Sahara_20180423123849_9161.jpg",
              "rating": "4.2",
              "numOfRating": "54",
              "description": "The history of Seorae dates back to Korean monarchs of old, when royal families demanded perfection, where the best quality ingredients were used. The highest quality meat served was galmaegisal, skirt meat that has the perfect combination of tenderness and juiciness. Other must-try meats here are the hangjeongsal (grilled juicy US pork jowl) and samgyeobsal (pork belly). Diners now can get a taste of what Korean royal perfection was all about.",
              "review": [
                     "Great ambience and service with tasty food.",
                     "Friendly staff and food is nice.",
                     "Very well cooked Indian food. Definitely worth it with the discount. Our children enjoyed it too",
                     "Enjoyed the food a lot. Will definitely patronize this restaurant again.",
                     "Good recommendations from the waitress. Awesome food especially the mutton and prawn curry."
              ]
       },
       {
              "name": "Saketoshi @ UE Square",
              "location": "Clarke Quay",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5011708_list_c8c10a0d-b0ec-4b26-b124-1e094964449f.jpeg",
              "rating": "0.0",
              "numOfRating": "42",
              "description": "The history of Seorae dates back to Korean monarchs of old, when royal families demanded perfection, where the best quality ingredients were used. The highest quality meat served was galmaegisal, skirt meat that has the perfect combination of tenderness and juiciness. Other must-try meats here are the hangjeongsal (grilled juicy US pork jowl) and samgyeobsal (pork belly). Diners now can get a taste of what Korean royal perfection was all about.",
              "review": [
                     "Good choices of food, very delicious, highly recommended",
                     "Very polite and professional staff, food was freshly prepared and delicious. would highly recommend"
              ]
       },
       {
              "name": "San Laksa Steamboat @ Kitchener Road",
              "location": "Farrer Park",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5011743_list_06b9824a-cafc-41ff-8efc-edc947fc1c77.jpeg",
              "rating": "4.7",
              "numOfRating": "86",
              "description": "The history of Seorae dates back to Korean monarchs of old, when royal families demanded perfection, where the best quality ingredients were used. The highest quality meat served was galmaegisal, skirt meat that has the perfect combination of tenderness and juiciness. Other must-try meats here are the hangjeongsal (grilled juicy US pork jowl) and samgyeobsal (pork belly). Diners now can get a taste of what Korean royal perfection was all about.",
              "review": [
                     "Great food as always!",
                     "3rd time at this restaurant and always enjoyed the dishes and great service from the waitress. As it is my son's birthday, the restaurant gave him a longevity noodle soup. So sweet!",
                     "Been back",
                     "Patient and helpful waiters, food cooked as expected without , especially impressed by the cleanly treated pig intestine, reasonable pricing",
                     "Great ambience, nice food and friendly staff. Will come back again!"
              ]
       },
       {
              "name": "San Ren Xing 三人行 @ Bedok Mall",
              "location": "Bedok",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5011757_list_ba03f9ec-0e69-486a-b2f7-89553f9a8364.png",
              "rating": "4.5",
              "numOfRating": "91",
              "description": "The history of Seorae dates back to Korean monarchs of old, when royal families demanded perfection, where the best quality ingredients were used. The highest quality meat served was galmaegisal, skirt meat that has the perfect combination of tenderness and juiciness. Other must-try meats here are the hangjeongsal (grilled juicy US pork jowl) and samgyeobsal (pork belly). Diners now can get a taste of what Korean royal perfection was all about.",
              "review": [
                     "Hidden Gems. Great food and great hospitality. 5 stars for the food and 6 six stars for the service provided. Will definitely come back",
                     "Excellent service, ambience and food",
                     "With eatigo discount, it was nice to have dinner there.",
                     "Excellent service , she is very engaging and always smiling and always happy to assist ! Best service staff that I have ever encountered! Repeated visit and she really remembers the guests though we were there 10 months ago !",
                     "All excellent ie. customer service, food, ambience (we brought our 2 pet dogs and were seated outside - non air conditioned) etc. except some irritating mosquitoes."
              ]
       },
       {
              "name": "San Ren Xing 三人行 @ Bugis Junction",
              "location": "Bugis",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5011756_list_a7126c0e-149a-47a4-b4d7-5feb4cce913e.png",
              "rating": "4.8",
              "numOfRating": "23",
              "description": "Founded in 2008, SHAMIANA Indian Restaurant focuses on curries and tandoor dishes across every region in India. The experienced kitchen use specialised woks for their signature curries and slow-fire clay ovens for tandoori dishes like classic tandoori chicken and tandoori lamb shank, which is marinated overnight.",
              "review": [
                     "I enjoyed mutton briyani =)"
              ]
       },
       {
              "name": "San Ren Xing 三人行 @ Thomson Plaza",
              "location": "Upper Thomson",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5011074_list_022c9ab9-c64a-4ae1-89ea-790cce31b50a.jpeg",
              "rating": "4.0",
              "numOfRating": "2",
              "description": "Shanthee’s Curry launched in 2009 at Veerasamy Road as a small family business enterprise. We serve authentic South Indian dishes from Tamil Nadu. Our Chefs hail from Madurai and Karaikudi and are sure to make one feel at home with their delectable cuisine!\n\n Our signature dishes include Southern style Fish Curry, Masala Tea and Egg Kalaki (Fun Fact: We introduced this dish here in Singapore). We also serve fusion food of high quality that is affordable for all.",
              "review": [
                     "Reasonable buffet lunch price with a wide range election of food. The service staffs are friendly, attentive and efficient to clear away the dishes too. Well done.",
                     "The food are very tasty and nice.",
                     "staffs are very helpful & accommodating to customers. nice restaurant to dine-in, frie dly atmosphere 👌",
                     "Friendly service staff. Food selection was decent. No WOW factor.",
                     "Very delicious food ! Enjoyed the beef rendang, Ayam buah keluak, sotong , satay and many more dishes. Dessert was fantastic with authentic tasting nonya kueh and others."
              ]
       },
       {
              "name": "SanSara @ Grand Copthorne Waterfront Hotel",
              "location": "River Valley",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5012216_list_2d89e521-4987-4015-8c6d-08c242f668f9.jpeg",
              "rating": "4.4",
              "numOfRating": "31",
              "description": "Shu Yan is a well-known Sichuan Chinese restaurant established in Chengdu in December 2004. They mainly specialise in Sichuan cuisine, the restaurant draws from the essence of Huaiyang and Cantonese flavours, experimenting with different flavours to create  contemporary Sichuan fusion cuisine. Located at Mohamed Sultan Road, the restaurant draws from the essence of Huaiyang and Cantonese flavours, serves delights like boiled fish fillet in spicy soup, stone pot tofu and fried chicken with dry chilli.",
              "review": [
                     "Great staff amazing service. Awesome food too. Would love an even cheesier pizza with a cheese pull.",
                     "Great service and food",
                     "always 👍 👍 👍 at Spizza Jalan Kayu! Super Staff and Food",
                     "Fantastic food. Outstanding staff especially Raf. Hope they give me a return voucher to enjoy their Isabella pizzas.",
                     "Absolutely beautiful experience at Spizza. Loved the Isabella pizza as it was extremely delicious. Elmer and Raf were the 2 outstanding staff from there, elevating the customer experience to another level. Hope to get a return voucher so that I can continue supporting them. I will also share this restaurant with my friends and encourage them to use Eatigo to book a table at this restaurant."
              ]
       },
       {
              "name": "SaVour Eat @ Jalan Besar",
              "location": "Jalan Besar",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5008714_list_4b5e7591-0b6d-49d6-98d5-bcbceff4f682.jpg",
              "rating": "4.1",
              "numOfRating": "11",
              "description": "Newly renovated, Shutters is an all day restaurant, offering relaxed bistro dining focusing on modern intercontinental cuisines. A bright, open dining space with sleek high ceilings, earth toned walls, and an open-kitchen, Shutters allows guests to dine indoors or al fresco on the outdoor terrace. Featuring an open concept kitchen where diners can watch chefs work their magic whipping up dozens of mouth-watering dishes ranging from both International delights to local favourites. Free parking available at Amara Sanctuary Resort Sentosa.",
              "review": [
                     "Service and food were good, except that lamb shank was not available and my friend was actually there to have it.",
                     "Good food great music",
                     "Excellent environment, music performance, food and the staff service."
              ]
       },
       {
              "name": "Seorae Korean Charcoal BBQ @ Compass One",
              "location": "Sengkang",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5011463_list_f498200b-0787-4524-803f-a9cdb1c7a422.jpeg",
              "rating": "4.0",
              "numOfRating": "0",
              "description": "Bringing people together through games, music, and so-good vibes.\n\nSo High is a social bar that offers unique experiences through its tech-integrated approach.\n\nOur proprietary app allows patrons to make live reservations and create customised avatars to earn gems that can be exchanged for various goodies in our e-shop. The app also allows patrons to interact with each other and participate in mini-games.\n\nSo High has the largest collection of party board games in Singapore, carefully curated to ensure a great experience with every visit.",
              "review": [
                     "GOOD RECOMMENDATION AND PRICE !",
                     "The food is ok not bad but alot of restrictions coz I booked for 2 pax, we can't order 3 set (but we are big eater) and your position is so small.",
                     "Ordered Tenderloin n Ribeye but Ribeye was very tough. Overall enjoyed the meal but expect zero service",
                     "Nice steak and friendly staff",
                     "Food is good - service so-so."
              ]
       },
       {
              "name": "Seorae Korean Charcoal BBQ @ JEM",
              "location": "Jurong East",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/eatigo_SeoraeKoreanCharocoalBBQJEM_20180207112413_9920.jpg",
              "rating": "4.0",
              "numOfRating": "0",
              "description": "Sticking to a keto diet means having to make some sacrifices. But thanks to Sofi Café, there’s no need to give up your favourite Italian food. You’ll find dishes like mushroom penne, roast pork belly with mash & salad, and burrata pizza featuring the perfect combination of flavourful food, yet still strictly keeping to keto diet requirements. Located along Craig Road, the café is just a short walk from Tanjong Pagar MRT station.",
              "review": [
                     "Nice food and good service. Will come back again for more",
                     "Food r fresh worth it",
                     "Nice food and value for money with eatigo discount. Will visit again.",
                     "authentic thai food , with great service ! will be back",
                     "Nice food n good deal after using eatigo discount"
              ]
       },
       {
              "name": "Seorae Korean Charcoal BBQ @ NEX",
              "location": "Serangoon Road",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/restaurant-cover-image/5011462_list_5c988183-eb99-4167-bed6-35b2c2464365.jpeg",
              "rating": "4.0",
              "numOfRating": "1",
              "description": "Sona’s Grill, a new entrant in North Indian cuisine has a vision to provide the Best North Indian",
              "review": [
                     "Slay slay",
                     "The customer service was good, the staff were attentive and friendly. The food was decent too.",
                     "Love the food! I've been thinking of the chicken and lamb mandi ever since. Must go back again soon.",
                     "Good and friendly service by staff Nive. She is patient and smiley to explain the different dishes. Food taste good with their skewer mixed grill with the meat still moist on the inside. Coupled well with the refreshing salad, hummus with their mezza combo. Finish off the meal with their mint lemonade as a palate cleanser. Definitely a satisfying meal and good deal with eatigo.",
                     "Quality and taste"
              ]
       },
       {
              "name": "Seorae Korean Charcoal BBQ @ Plaza Singapura",
              "location": "Dhoby Ghaut",
              "imageLink": "https://cdn.eatigo.com/filters:format(webp)/eatigo_SeoraeKoreanCharcoalBBQ_20170804155027_9883.jpg",
              "rating": "4.4",
              "numOfRating": "13",
              "description": "Striking black and white décor, hints of red, grandly tufted booths and an amber dome; the eye-catching décor is reflected in the walls of cleverly framed mirrors. Not that you'd be staring at your surroundings when there are counters laden with mouth-watering concoctions right before your eyes!\n\nA local flavour buffet by day, Spices Café is a seafood buffet by night and an all-day casual dining destination with an extensive a la carte menu. Located within the Concorde Hotel, visitors will find themselves indulging in a dining experience that reflect the dedicated chef’s culinary styles. They will enjoy dishes like chilli crab, nyonya laksa and ayam buah keluak as they dine within a colonial and regal ambience.",
              "review": [
                     "As usual, Tandoori Culture provides good food and outstanding service. So far, none of my friends have been disappointed with the dining experience.",
                     "Food was great and service excellent!",
                     "Food was good esp the garlic naan. Service was friendly. Will definitely return with the good eatigo discount",
                     "The fish curry portion is big and fair amount of meat. Naan is nice! Will come back again.",
                     "Excellent service and we enjoyed all the food we ordered. Monthly visit to this restaurant. love the Gobi chilli."
              ]
       }
]